window.SAMPLE_EXAMS = [
  {
    "رمز المقرر": "COMP2002",
    "اسم المقرر": "computer2",
    "عدد الطلاب": 1,
    "اليوم": "الأحد",
    "التاريخ": "24/05/2026",
    "الفترة": "9 - 10:30",
    "الشعبة": 210,
    "القاعة": "D05"
  },
  {
    "رمز المقرر": "EDAE3105",
    "اسم المقرر": "القياس النفسي والتقويم التربوي",
    "عدد الطلاب": 22,
    "اليوم": "الأحد",
    "التاريخ": "07/06/2026",
    "الفترة": "11 - 1",
    "الشعبة": 1,
    "القاعة": "D07"
  },
  {
    "رمز المقرر": "EDAE3105",
    "اسم المقرر": "القياس النفسي والتقويم التربوي",
    "عدد الطلاب": 26,
    "اليوم": "الأحد",
    "التاريخ": "07/06/2026",
    "الفترة": "11 - 1",
    "الشعبة": 2,
    "القاعة": "D012"
  },
  {
    "رمز المقرر": "EDAE3105",
    "اسم المقرر": "القياس النفسي والتقويم التربوي",
    "عدد الطلاب": 24,
    "اليوم": "الأحد",
    "التاريخ": "07/06/2026",
    "الفترة": "11 - 1",
    "الشعبة": 3,
    "القاعة": "D014"
  },
  {
    "رمز المقرر": "EDAE3105",
    "اسم المقرر": "القياس النفسي والتقويم التربوي",
    "عدد الطلاب": 22,
    "اليوم": "الأحد",
    "التاريخ": "07/06/2026",
    "الفترة": "11 - 1",
    "الشعبة": 4,
    "القاعة": "D09"
  },
  {
    "رمز المقرر": "EDAE3105",
    "اسم المقرر": "القياس النفسي والتقويم التربوي",
    "عدد الطلاب": 36,
    "اليوم": "الأحد",
    "التاريخ": "07/06/2026",
    "الفترة": "11 - 1",
    "الشعبة": 5,
    "القاعة": "D05"
  },
  {
    "رمز المقرر": "EDAE3106",
    "اسم المقرر": "Psychometric Assessment and Educational Evaluation",
    "عدد الطلاب": 26,
    "اليوم": "الثلاثاء",
    "التاريخ": "02/06/2026",
    "الفترة": "11 - 1",
    "الشعبة": 1,
    "القاعة": "D012"
  },
  {
    "رمز المقرر": "EDAE3106",
    "اسم المقرر": "Psychometric Assessment and Educational Evaluation",
    "عدد الطلاب": 21,
    "اليوم": "الثلاثاء",
    "التاريخ": "02/06/2026",
    "الفترة": "11 - 1",
    "الشعبة": 2,
    "القاعة": "D07"
  },
  {
    "رمز المقرر": "EDBI1103",
    "اسم المقرر": "مقدمة في علم النبات",
    "عدد الطلاب": 29,
    "اليوم": "الثلاثاء",
    "التاريخ": "09/06/2026",
    "الفترة": "8:15 - 10:15",
    "الشعبة": 1,
    "القاعة": "D013"
  },
  {
    "رمز المقرر": "EDBI1103",
    "اسم المقرر": "مقدمة في علم النبات",
    "عدد الطلاب": 16,
    "اليوم": "الثلاثاء",
    "التاريخ": "09/06/2026",
    "الفترة": "8:15 - 10:15",
    "الشعبة": 2,
    "القاعة": "D09"
  },
  {
    "رمز المقرر": "EDBI1205",
    "اسم المقرر": "مورفولوجيا النبات وتشريحه",
    "عدد الطلاب": 26,
    "اليوم": "الأحد",
    "التاريخ": "31/05/2026",
    "الفترة": "8:15 - 10:15",
    "الشعبة": 1,
    "القاعة": "D012"
  },
  {
    "رمز المقرر": "EDBI1205",
    "اسم المقرر": "مورفولوجيا النبات وتشريحه",
    "عدد الطلاب": 23,
    "اليوم": "الأحد",
    "التاريخ": "31/05/2026",
    "الفترة": "8:15 - 10:15",
    "الشعبة": 2,
    "القاعة": "D07"
  },
  {
    "رمز المقرر": "EDBI1206",
    "اسم المقرر": "علم البيئة والتنوع الحيوي",
    "عدد الطلاب": 22,
    "اليوم": "الأربعاء",
    "التاريخ": "10/06/2026",
    "الفترة": "11 - 1",
    "الشعبة": 1,
    "القاعة": "D09"
  },
  {
    "رمز المقرر": "EDBI1206",
    "اسم المقرر": "علم البيئة والتنوع الحيوي",
    "عدد الطلاب": 24,
    "اليوم": "الأربعاء",
    "التاريخ": "10/06/2026",
    "الفترة": "11 - 1",
    "الشعبة": 2,
    "القاعة": "D07"
  },
  {
    "رمز المقرر": "EDBI2107",
    "اسم المقرر": "علم الأنسجة",
    "عدد الطلاب": 3,
    "اليوم": "الإثنين",
    "التاريخ": "25/05/2026",
    "الفترة": "11 - 1",
    "الشعبة": 1,
    "القاعة": "D013"
  },
  {
    "رمز المقرر": "EDBI2209",
    "اسم المقرر": "تصنيف النبات 1",
    "عدد الطلاب": 24,
    "اليوم": "الأحد",
    "التاريخ": "31/05/2026",
    "الفترة": "8:15 - 10:15",
    "الشعبة": 1,
    "القاعة": "C04"
  },
  {
    "رمز المقرر": "EDBI2209",
    "اسم المقرر": "تصنيف النبات 1",
    "عدد الطلاب": 16,
    "اليوم": "الأحد",
    "التاريخ": "31/05/2026",
    "الفترة": "8:15 - 10:15",
    "الشعبة": 2,
    "القاعة": "C04"
  },
  {
    "رمز المقرر": "EDBI2210",
    "اسم المقرر": "التطور العضوي ومبادئ السلوك",
    "عدد الطلاب": 26,
    "اليوم": "الأحد",
    "التاريخ": "07/06/2026",
    "الفترة": "8:15 - 10:15",
    "الشعبة": 1,
    "القاعة": "C04"
  },
  {
    "رمز المقرر": "EDBI2210",
    "اسم المقرر": "التطور العضوي ومبادئ السلوك",
    "عدد الطلاب": 12,
    "اليوم": "الأحد",
    "التاريخ": "07/06/2026",
    "الفترة": "8:15 - 10:15",
    "الشعبة": 2,
    "القاعة": "C04"
  },
  {
    "رمز المقرر": "EDBI3112",
    "اسم المقرر": "تصنيف النبات 2",
    "عدد الطلاب": 2,
    "اليوم": "الأربعاء",
    "التاريخ": "10/06/2026",
    "الفترة": "8:15 - 10:15",
    "الشعبة": 1,
    "القاعة": "D09"
  },
  {
    "رمز المقرر": "EDBI3114",
    "اسم المقرر": "الأحياء الدقيقة",
    "عدد الطلاب": 2,
    "اليوم": "الإثنين",
    "التاريخ": "01/06/2026",
    "الفترة": "8:15 - 10:15",
    "الشعبة": 1,
    "القاعة": "D09"
  },
  {
    "رمز المقرر": "EDBI3215",
    "اسم المقرر": "الفسيولوجيا الحيوانية 2",
    "عدد الطلاب": 22,
    "اليوم": "الأحد",
    "التاريخ": "24/05/2026",
    "الفترة": "8:15 - 10:15",
    "الشعبة": 1,
    "القاعة": "D07"
  },
  {
    "رمز المقرر": "EDBI3215",
    "اسم المقرر": "الفسيولوجيا الحيوانية 2",
    "عدد الطلاب": 18,
    "اليوم": "الأحد",
    "التاريخ": "24/05/2026",
    "الفترة": "8:15 - 10:15",
    "الشعبة": 2,
    "القاعة": "D09"
  },
  {
    "رمز المقرر": "EDBI3216",
    "اسم المقرر": "الفقاريات وجسم الإنسان",
    "عدد الطلاب": 31,
    "اليوم": "الخميس",
    "التاريخ": "04/06/2026",
    "الفترة": "11 - 1",
    "الشعبة": 1,
    "القاعة": "D112"
  },
  {
    "رمز المقرر": "EDBI3216",
    "اسم المقرر": "الفقاريات وجسم الإنسان",
    "عدد الطلاب": 15,
    "اليوم": "الخميس",
    "التاريخ": "04/06/2026",
    "الفترة": "11 - 1",
    "الشعبة": 2,
    "القاعة": "D114"
  },
  {
    "رمز المقرر": "EDBI3217",
    "اسم المقرر": "الفسيولوجيا النباتية",
    "عدد الطلاب": 18,
    "اليوم": "الأحد",
    "التاريخ": "31/05/2026",
    "الفترة": "8:15 - 10:15",
    "الشعبة": 1,
    "القاعة": "D112"
  },
  {
    "رمز المقرر": "EDBI3217",
    "اسم المقرر": "الفسيولوجيا النباتية",
    "عدد الطلاب": 22,
    "اليوم": "الأحد",
    "التاريخ": "31/05/2026",
    "الفترة": "8:15 - 10:15",
    "الشعبة": 2,
    "القاعة": "D114"
  },
  {
    "رمز المقرر": "EDBI3218",
    "اسم المقرر": "علم الوراثة",
    "عدد الطلاب": 33,
    "اليوم": "الثلاثاء",
    "التاريخ": "02/06/2026",
    "الفترة": "8:15 - 10:15",
    "الشعبة": 1,
    "القاعة": "D05"
  },
  {
    "رمز المقرر": "EDBI3218",
    "اسم المقرر": "علم الوراثة",
    "عدد الطلاب": 11,
    "اليوم": "الثلاثاء",
    "التاريخ": "02/06/2026",
    "الفترة": "8:15 - 10:15",
    "الشعبة": 2,
    "القاعة": "D05"
  },
  {
    "رمز المقرر": "EDBI4120",
    "اسم المقرر": "علم التطفل والمناعة",
    "عدد الطلاب": 1,
    "اليوم": "الأحد",
    "التاريخ": "24/05/2026",
    "الفترة": "8:15 - 10:15",
    "الشعبة": 1,
    "القاعة": "D09"
  },
  {
    "رمز المقرر": "EDBI4221",
    "اسم المقرر": "الهندسة الوراثية والتقنية الحيوية",
    "عدد الطلاب": 8,
    "اليوم": "الإثنين",
    "التاريخ": "08/06/2026",
    "الفترة": "8:15 - 10:15",
    "الشعبة": 1,
    "القاعة": "D09"
  },
  {
    "رمز المقرر": "EDBI4221",
    "اسم المقرر": "الهندسة الوراثية والتقنية الحيوية",
    "عدد الطلاب": 17,
    "اليوم": "الإثنين",
    "التاريخ": "08/06/2026",
    "الفترة": "8:15 - 10:15",
    "الشعبة": 2,
    "القاعة": "D09"
  },
  {
    "رمز المقرر": "EDBI4222",
    "اسم المقرر": "الأحياء الدقيقة التطبيقية",
    "عدد الطلاب": 13,
    "اليوم": "الإثنين",
    "التاريخ": "01/06/2026",
    "الفترة": "8:15 - 10:15",
    "الشعبة": 1,
    "القاعة": "D114"
  },
  {
    "رمز المقرر": "EDBI4223",
    "اسم المقرر": "الغذاء والتغذية",
    "عدد الطلاب": 16,
    "اليوم": "الإثنين",
    "التاريخ": "01/06/2026",
    "الفترة": "8:15 - 10:15",
    "الشعبة": 1,
    "القاعة": "D110"
  },
  {
    "رمز المقرر": "EDCH1101",
    "اسم المقرر": "الكيمياء العامة 1",
    "عدد الطلاب": 11,
    "اليوم": "الثلاثاء",
    "التاريخ": "02/06/2026",
    "الفترة": "8:15 - 10:15",
    "الشعبة": 1,
    "القاعة": "D109"
  },
  {
    "رمز المقرر": "EDCH1203",
    "اسم المقرر": "الكيمياء العامة وغير العضوية",
    "عدد الطلاب": 25,
    "اليوم": "الثلاثاء",
    "التاريخ": "02/06/2026",
    "الفترة": "8:15 - 10:15",
    "الشعبة": 1,
    "القاعة": "D07"
  },
  {
    "رمز المقرر": "EDCH1203",
    "اسم المقرر": "الكيمياء العامة وغير العضوية",
    "عدد الطلاب": 14,
    "اليوم": "الثلاثاء",
    "التاريخ": "02/06/2026",
    "الفترة": "8:15 - 10:15",
    "الشعبة": 2,
    "القاعة": "D113"
  },
  {
    "رمز المقرر": "EDCH1204",
    "اسم المقرر": "الكيمياء العامة 2",
    "عدد الطلاب": 24,
    "اليوم": "الإثنين",
    "التاريخ": "01/06/2026",
    "الفترة": "8:15 - 10:15",
    "الشعبة": 1,
    "القاعة": "D09"
  },
  {
    "رمز المقرر": "EDCH1204",
    "اسم المقرر": "الكيمياء العامة 2",
    "عدد الطلاب": 10,
    "اليوم": "الإثنين",
    "التاريخ": "01/06/2026",
    "الفترة": "8:15 - 10:15",
    "الشعبة": 2,
    "القاعة": "D103"
  },
  {
    "رمز المقرر": "EDCH1204",
    "اسم المقرر": "الكيمياء العامة 2",
    "عدد الطلاب": 24,
    "اليوم": "الإثنين",
    "التاريخ": "01/06/2026",
    "الفترة": "8:15 - 10:15",
    "الشعبة": 3,
    "القاعة": "D014"
  },
  {
    "رمز المقرر": "EDCH1204",
    "اسم المقرر": "الكيمياء العامة 2",
    "عدد الطلاب": 14,
    "اليوم": "الإثنين",
    "التاريخ": "01/06/2026",
    "الفترة": "8:15 - 10:15",
    "الشعبة": 4,
    "القاعة": "D113"
  },
  {
    "رمز المقرر": "EDCH2210",
    "اسم المقرر": "الكيمياء العضوية 2",
    "عدد الطلاب": 29,
    "اليوم": "الأحد",
    "التاريخ": "07/06/2026",
    "الفترة": "8:15 - 10:15",
    "الشعبة": 1,
    "القاعة": "D013"
  },
  {
    "رمز المقرر": "EDCH2210",
    "اسم المقرر": "الكيمياء العضوية 2",
    "عدد الطلاب": 18,
    "اليوم": "الأحد",
    "التاريخ": "07/06/2026",
    "الفترة": "8:15 - 10:15",
    "الشعبة": 2,
    "القاعة": "D110"
  },
  {
    "رمز المقرر": "EDCH2211",
    "اسم المقرر": "الكيمياء الفيزيائية 1",
    "عدد الطلاب": 28,
    "اليوم": "الإثنين",
    "التاريخ": "25/05/2026",
    "الفترة": "11 - 1",
    "الشعبة": 1,
    "القاعة": "D012"
  },
  {
    "رمز المقرر": "EDCH2211",
    "اسم المقرر": "الكيمياء الفيزيائية 1",
    "عدد الطلاب": 16,
    "اليوم": "الإثنين",
    "التاريخ": "25/05/2026",
    "الفترة": "11 - 1",
    "الشعبة": 2,
    "القاعة": "D05"
  },
  {
    "رمز المقرر": "EDCH2212",
    "اسم المقرر": "الكيمياء غير العضوية 1",
    "عدد الطلاب": 26,
    "اليوم": "الإثنين",
    "التاريخ": "01/06/2026",
    "الفترة": "11 - 1",
    "الشعبة": 1,
    "القاعة": "D012"
  },
  {
    "رمز المقرر": "EDCH2212",
    "اسم المقرر": "الكيمياء غير العضوية 1",
    "عدد الطلاب": 25,
    "اليوم": "الإثنين",
    "التاريخ": "01/06/2026",
    "الفترة": "11 - 1",
    "الشعبة": 2,
    "القاعة": "D013"
  },
  {
    "رمز المقرر": "EDCH3216",
    "اسم المقرر": "الكيمياء غير العضوية 3",
    "عدد الطلاب": 15,
    "اليوم": "الثلاثاء",
    "التاريخ": "02/06/2026",
    "الفترة": "8:15 - 10:15",
    "الشعبة": 1,
    "القاعة": "D113"
  },
  {
    "رمز المقرر": "EDCH3216",
    "اسم المقرر": "الكيمياء غير العضوية 3",
    "عدد الطلاب": 20,
    "اليوم": "الثلاثاء",
    "التاريخ": "02/06/2026",
    "الفترة": "8:15 - 10:15",
    "الشعبة": 2,
    "القاعة": "D09"
  },
  {
    "رمز المقرر": "EDCH3217",
    "اسم المقرر": "الكيمياء التحليلية 2",
    "عدد الطلاب": 21,
    "اليوم": "الثلاثاء",
    "التاريخ": "09/06/2026",
    "الفترة": "8:15 - 10:15",
    "الشعبة": 1,
    "القاعة": "D05"
  },
  {
    "رمز المقرر": "EDCH3217",
    "اسم المقرر": "الكيمياء التحليلية 2",
    "عدد الطلاب": 26,
    "اليوم": "الثلاثاء",
    "التاريخ": "09/06/2026",
    "الفترة": "8:15 - 10:15",
    "الشعبة": 2,
    "القاعة": "D05"
  },
  {
    "رمز المقرر": "EDCH3218",
    "اسم المقرر": "الكيمياء الفيزيائية 3",
    "عدد الطلاب": 18,
    "اليوم": "الخميس",
    "التاريخ": "04/06/2026",
    "الفترة": "8:15 - 10:15",
    "الشعبة": 1,
    "القاعة": "D07"
  },
  {
    "رمز المقرر": "EDCH3218",
    "اسم المقرر": "الكيمياء الفيزيائية 3",
    "عدد الطلاب": 19,
    "اليوم": "الخميس",
    "التاريخ": "04/06/2026",
    "الفترة": "8:15 - 10:15",
    "الشعبة": 2,
    "القاعة": "D014"
  },
  {
    "رمز المقرر": "EDCH4120",
    "اسم المقرر": "الكيمياء الحيوية",
    "عدد الطلاب": 22,
    "اليوم": "السبت",
    "التاريخ": "06/06/2026",
    "الفترة": "11 - 1",
    "الشعبة": 1,
    "القاعة": "D013"
  },
  {
    "رمز المقرر": "EDCH4120",
    "اسم المقرر": "الكيمياء الحيوية",
    "عدد الطلاب": 20,
    "اليوم": "السبت",
    "التاريخ": "06/06/2026",
    "الفترة": "11 - 1",
    "الشعبة": 2,
    "القاعة": "D09"
  },
  {
    "رمز المقرر": "EDCH4222",
    "اسم المقرر": "الكيمياء التطبيقية 2",
    "عدد الطلاب": 22,
    "اليوم": "الخميس",
    "التاريخ": "11/06/2026",
    "الفترة": "11 - 1",
    "الشعبة": 1,
    "القاعة": "D014"
  },
  {
    "رمز المقرر": "EDCH4223",
    "اسم المقرر": "كيمياء البيئة",
    "عدد الطلاب": 25,
    "اليوم": "الأحد",
    "التاريخ": "24/05/2026",
    "الفترة": "11 - 1",
    "الشعبة": 1,
    "القاعة": "D09"
  },
  {
    "رمز المقرر": "EDCM2103",
    "اسم المقرر": "General Curriculum & Teaching Methods",
    "عدد الطلاب": 14,
    "اليوم": "الإثنين",
    "التاريخ": "01/06/2026",
    "الفترة": "8:15 - 10:15",
    "الشعبة": 1,
    "القاعة": "D113"
  },
  {
    "رمز المقرر": "EDCM2103",
    "اسم المقرر": "General Curriculum & Teaching Methods",
    "عدد الطلاب": 26,
    "اليوم": "الإثنين",
    "التاريخ": "01/06/2026",
    "الفترة": "8:15 - 10:15",
    "الشعبة": 2,
    "القاعة": "D013"
  },
  {
    "رمز المقرر": "EDCS2102",
    "اسم المقرر": "Advanced computer skills",
    "عدد الطلاب": 26,
    "اليوم": "الأحد",
    "التاريخ": "24/05/2026",
    "الفترة": "9 - 10:30",
    "الشعبة": 1,
    "القاعة": "D05"
  },
  {
    "رمز المقرر": "EDCS2102",
    "اسم المقرر": "Advanced computer skills",
    "عدد الطلاب": 19,
    "اليوم": "الأحد",
    "التاريخ": "24/05/2026",
    "الفترة": "9 - 10:30",
    "الشعبة": 2,
    "القاعة": "D05"
  },
  {
    "رمز المقرر": "EDCS3204",
    "اسم المقرر": "برمجة",
    "عدد الطلاب": 24,
    "اليوم": "الأحد",
    "التاريخ": "24/05/2026",
    "الفترة": "9 - 10:30",
    "الشعبة": 1,
    "القاعة": "D012"
  },
  {
    "رمز المقرر": "EDCS3204",
    "اسم المقرر": "برمجة",
    "عدد الطلاب": 25,
    "اليوم": "الأحد",
    "التاريخ": "24/05/2026",
    "الفترة": "9 - 10:30",
    "الشعبة": 2,
    "القاعة": "D013"
  },
  {
    "رمز المقرر": "EDDM4108",
    "اسم المقرر": "علم نفس النمو والصحة النفسية",
    "عدد الطلاب": 21,
    "اليوم": "الإثنين",
    "التاريخ": "25/05/2026",
    "الفترة": "11 - 1",
    "الشعبة": 1,
    "القاعة": "D114"
  },
  {
    "رمز المقرر": "EDDM4108",
    "اسم المقرر": "علم نفس النمو والصحة النفسية",
    "عدد الطلاب": 20,
    "اليوم": "الإثنين",
    "التاريخ": "25/05/2026",
    "الفترة": "11 - 1",
    "الشعبة": 2,
    "القاعة": "D112"
  },
  {
    "رمز المقرر": "EDDM4109",
    "اسم المقرر": "Developmental Psychology and Mental Health",
    "عدد الطلاب": 18,
    "اليوم": "الإثنين",
    "التاريخ": "25/05/2026",
    "الفترة": "11 - 1",
    "الشعبة": 1,
    "القاعة": "C04"
  },
  {
    "رمز المقرر": "EDDM4109",
    "اسم المقرر": "Developmental Psychology and Mental Health",
    "عدد الطلاب": 17,
    "اليوم": "الإثنين",
    "التاريخ": "25/05/2026",
    "الفترة": "11 - 1",
    "الشعبة": 2,
    "القاعة": "C04"
  },
  {
    "رمز المقرر": "EDEF1101",
    "اسم المقرر": "أصول التربية",
    "عدد الطلاب": 52,
    "اليوم": "الثلاثاء",
    "التاريخ": "02/06/2026",
    "الفترة": "11 - 1",
    "الشعبة": 1,
    "القاعة": "D05"
  },
  {
    "رمز المقرر": "EDEF1102",
    "اسم المقرر": "Educational Foundations",
    "عدد الطلاب": 56,
    "اليوم": "الثلاثاء",
    "التاريخ": "02/06/2026",
    "الفترة": "11 - 1",
    "الشعبة": 1,
    "القاعة": "قاعة المعارض"
  },
  {
    "رمز المقرر": "EDEN1101",
    "اسم المقرر": "Adv. English Language Awareness: Grammar",
    "عدد الطلاب": 25,
    "اليوم": "الخميس",
    "التاريخ": "11/06/2026",
    "الفترة": "8:15 - 10:15",
    "الشعبة": 1,
    "القاعة": "D012"
  },
  {
    "رمز المقرر": "EDEN1101",
    "اسم المقرر": "Adv. English Language Awareness: Grammar",
    "عدد الطلاب": 36,
    "اليوم": "الخميس",
    "التاريخ": "11/06/2026",
    "الفترة": "8:15 - 10:15",
    "الشعبة": 2,
    "القاعة": "C03"
  },
  {
    "رمز المقرر": "EDEN1102",
    "اسم المقرر": "Adv. English Language Awareness: Listening & Speaking",
    "عدد الطلاب": 34,
    "اليوم": "الأحد",
    "التاريخ": "31/05/2026",
    "الفترة": "8:15 - 10:15",
    "الشعبة": 1,
    "القاعة": "D05"
  },
  {
    "رمز المقرر": "EDEN1102",
    "اسم المقرر": "Adv. English Language Awareness: Listening & Speaking",
    "عدد الطلاب": 13,
    "اليوم": "الأحد",
    "التاريخ": "31/05/2026",
    "الفترة": "8:15 - 10:15",
    "الشعبة": 2,
    "القاعة": "D014"
  },
  {
    "رمز المقرر": "EDEN1103",
    "اسم المقرر": "Writing for Professional purposes",
    "عدد الطلاب": 36,
    "اليوم": "الثلاثاء",
    "التاريخ": "09/06/2026",
    "الفترة": "11 - 1",
    "الشعبة": 1,
    "القاعة": "D05"
  },
  {
    "رمز المقرر": "EDEN1103",
    "اسم المقرر": "Writing for Professional purposes",
    "عدد الطلاب": 21,
    "اليوم": "الثلاثاء",
    "التاريخ": "09/06/2026",
    "الفترة": "11 - 1",
    "الشعبة": 2,
    "القاعة": "D07"
  },
  {
    "رمز المقرر": "EDEN1104",
    "اسم المقرر": "Critical Thinking, Language, and Ethics",
    "عدد الطلاب": 20,
    "اليوم": "الأربعاء",
    "التاريخ": "03/06/2026",
    "الفترة": "11 - 1",
    "الشعبة": 1,
    "القاعة": "D013"
  },
  {
    "رمز المقرر": "EDEN1104",
    "اسم المقرر": "Critical Thinking, Language, and Ethics",
    "عدد الطلاب": 37,
    "اليوم": "الأربعاء",
    "التاريخ": "03/06/2026",
    "الفترة": "11 - 1",
    "الشعبة": 2,
    "القاعة": "C03"
  },
  {
    "رمز المقرر": "EDEN1205",
    "اسم المقرر": "Adv. English Language Awareness: Reading & Writing",
    "عدد الطلاب": 27,
    "اليوم": "الثلاثاء",
    "التاريخ": "02/06/2026",
    "الفترة": "8:15 - 10:15",
    "الشعبة": 1,
    "القاعة": "D014"
  },
  {
    "رمز المقرر": "EDEN1205",
    "اسم المقرر": "Adv. English Language Awareness: Reading & Writing",
    "عدد الطلاب": 18,
    "اليوم": "الثلاثاء",
    "التاريخ": "02/06/2026",
    "الفترة": "8:15 - 10:15",
    "الشعبة": 2,
    "القاعة": "D109"
  },
  {
    "رمز المقرر": "EDEN1206",
    "اسم المقرر": "Critical Reading",
    "عدد الطلاب": 13,
    "اليوم": "الأربعاء",
    "التاريخ": "10/06/2026",
    "الفترة": "11 - 1",
    "الشعبة": 1,
    "القاعة": "D112"
  },
  {
    "رمز المقرر": "EDEN1206",
    "اسم المقرر": "Critical Reading",
    "عدد الطلاب": 26,
    "اليوم": "الأربعاء",
    "التاريخ": "10/06/2026",
    "الفترة": "11 - 1",
    "الشعبة": 2,
    "القاعة": "D013"
  },
  {
    "رمز المقرر": "EDEN1207",
    "اسم المقرر": "Introduction to Linguistics",
    "عدد الطلاب": 25,
    "اليوم": "الأحد",
    "التاريخ": "07/06/2026",
    "الفترة": "8:15 - 10:15",
    "الشعبة": 1,
    "القاعة": "D109"
  },
  {
    "رمز المقرر": "EDEN1207",
    "اسم المقرر": "Introduction to Linguistics",
    "عدد الطلاب": 28,
    "اليوم": "الأحد",
    "التاريخ": "07/06/2026",
    "الفترة": "8:15 - 10:15",
    "الشعبة": 2,
    "القاعة": "D07"
  },
  {
    "رمز المقرر": "EDEN2108",
    "اسم المقرر": "Phonetics and Phonology",
    "عدد الطلاب": 23,
    "اليوم": "الثلاثاء",
    "التاريخ": "09/06/2026",
    "الفترة": "8:15 - 10:15",
    "الشعبة": 1,
    "القاعة": "D07"
  },
  {
    "رمز المقرر": "EDEN2108",
    "اسم المقرر": "Phonetics and Phonology",
    "عدد الطلاب": 30,
    "اليوم": "الثلاثاء",
    "التاريخ": "09/06/2026",
    "الفترة": "8:15 - 10:15",
    "الشعبة": 2,
    "القاعة": "D012"
  },
  {
    "رمز المقرر": "EDEN2109",
    "اسم المقرر": "Introduction to Literature",
    "عدد الطلاب": 25,
    "اليوم": "الأحد",
    "التاريخ": "31/05/2026",
    "الفترة": "8:15 - 10:15",
    "الشعبة": 1,
    "القاعة": "D013"
  },
  {
    "رمز المقرر": "EDEN2109",
    "اسم المقرر": "Introduction to Literature",
    "عدد الطلاب": 22,
    "اليوم": "الأحد",
    "التاريخ": "31/05/2026",
    "الفترة": "8:15 - 10:15",
    "الشعبة": 2,
    "القاعة": "D09"
  },
  {
    "رمز المقرر": "EDEN2110",
    "اسم المقرر": "Special Topics in Applied Linguistics",
    "عدد الطلاب": 51,
    "اليوم": "الخميس",
    "التاريخ": "11/06/2026",
    "الفترة": "8:15 - 10:15",
    "الشعبة": 1,
    "القاعة": "D05"
  },
  {
    "رمز المقرر": "EDEN2211",
    "اسم المقرر": "Morphology and Syntax",
    "عدد الطلاب": 18,
    "اليوم": "الثلاثاء",
    "التاريخ": "02/06/2026",
    "الفترة": "11 - 1",
    "الشعبة": 1,
    "القاعة": "D09"
  },
  {
    "رمز المقرر": "EDEN2211",
    "اسم المقرر": "Morphology and Syntax",
    "عدد الطلاب": 22,
    "اليوم": "الثلاثاء",
    "التاريخ": "02/06/2026",
    "الفترة": "11 - 1",
    "الشعبة": 2,
    "القاعة": "D013"
  },
  {
    "رمز المقرر": "EDEN2212",
    "اسم المقرر": "Children's Literature",
    "عدد الطلاب": 16,
    "اليوم": "الأربعاء",
    "التاريخ": "03/06/2026",
    "الفترة": "8:15 - 10:15",
    "الشعبة": 1,
    "القاعة": "D09"
  },
  {
    "رمز المقرر": "EDEN2212",
    "اسم المقرر": "Children's Literature",
    "عدد الطلاب": 33,
    "اليوم": "الأربعاء",
    "التاريخ": "03/06/2026",
    "الفترة": "8:15 - 10:15",
    "الشعبة": 2,
    "القاعة": "C03"
  },
  {
    "رمز المقرر": "EDEN2213",
    "اسم المقرر": "Initial Literacy in English",
    "عدد الطلاب": 19,
    "اليوم": "الإثنين",
    "التاريخ": "08/06/2026",
    "الفترة": "8:15 - 10:15",
    "الشعبة": 1,
    "القاعة": "D013"
  },
  {
    "رمز المقرر": "EDEN2213",
    "اسم المقرر": "Initial Literacy in English",
    "عدد الطلاب": 24,
    "اليوم": "الإثنين",
    "التاريخ": "08/06/2026",
    "الفترة": "8:15 - 10:15",
    "الشعبة": 2,
    "القاعة": "D07"
  },
  {
    "رمز المقرر": "EDEN3114",
    "اسم المقرر": "Language Acquisition",
    "عدد الطلاب": 25,
    "اليوم": "الأحد",
    "التاريخ": "07/06/2026",
    "الفترة": "11 - 1",
    "الشعبة": 1,
    "القاعة": "D013"
  },
  {
    "رمز المقرر": "EDEN3114",
    "اسم المقرر": "Language Acquisition",
    "عدد الطلاب": 22,
    "اليوم": "الأحد",
    "التاريخ": "07/06/2026",
    "الفترة": "11 - 1",
    "الشعبة": 2,
    "القاعة": "D112"
  },
  {
    "رمز المقرر": "EDEN3115",
    "اسم المقرر": "Semantics and Pragmatics",
    "عدد الطلاب": 15,
    "اليوم": "الأربعاء",
    "التاريخ": "10/06/2026",
    "الفترة": "8:15 - 10:15",
    "الشعبة": 1,
    "القاعة": "D09"
  },
  {
    "رمز المقرر": "EDEN3115",
    "اسم المقرر": "Semantics and Pragmatics",
    "عدد الطلاب": 24,
    "اليوم": "الأربعاء",
    "التاريخ": "10/06/2026",
    "الفترة": "8:15 - 10:15",
    "الشعبة": 2,
    "القاعة": "D013"
  },
  {
    "رمز المقرر": "EDEN3116",
    "اسم المقرر": "World Literature",
    "عدد الطلاب": 38,
    "اليوم": "الإثنين",
    "التاريخ": "25/05/2026",
    "الفترة": "11 - 1",
    "الشعبة": 1,
    "القاعة": "D05"
  },
  {
    "رمز المقرر": "EDEN3116",
    "اسم المقرر": "World Literature",
    "عدد الطلاب": 23,
    "اليوم": "الإثنين",
    "التاريخ": "25/05/2026",
    "الفترة": "11 - 1",
    "الشعبة": 2,
    "القاعة": "D09"
  },
  {
    "رمز المقرر": "EDEN3119",
    "اسم المقرر": "Language Competencies Planning and Evaluation",
    "عدد الطلاب": 38,
    "اليوم": "الإثنين",
    "التاريخ": "01/06/2026",
    "الفترة": "11 - 1",
    "الشعبة": 1,
    "القاعة": "C03"
  },
  {
    "رمز المقرر": "EDEN3220",
    "اسم المقرر": "Models and Technologies for Language Competencies",
    "عدد الطلاب": 23,
    "اليوم": "الإثنين",
    "التاريخ": "08/06/2026",
    "الفترة": "11 - 1",
    "الشعبة": 1,
    "القاعة": "D09"
  },
  {
    "رمز المقرر": "EDEN3220",
    "اسم المقرر": "Models and Technologies for Language Competencies",
    "عدد الطلاب": 24,
    "اليوم": "الإثنين",
    "التاريخ": "08/06/2026",
    "الفترة": "11 - 1",
    "الشعبة": 2,
    "القاعة": "D07"
  },
  {
    "رمز المقرر": "EDEN3221",
    "اسم المقرر": "Error Recognition and Correction",
    "عدد الطلاب": 20,
    "اليوم": "الخميس",
    "التاريخ": "04/06/2026",
    "الفترة": "8:15 - 10:15",
    "الشعبة": 1,
    "القاعة": "D013"
  },
  {
    "رمز المقرر": "EDEN3221",
    "اسم المقرر": "Error Recognition and Correction",
    "عدد الطلاب": 38,
    "اليوم": "الخميس",
    "التاريخ": "04/06/2026",
    "الفترة": "8:15 - 10:15",
    "الشعبة": 2,
    "القاعة": "D05"
  },
  {
    "رمز المقرر": "EDEN3224",
    "اسم المقرر": "Discourse Analysis",
    "عدد الطلاب": 46,
    "اليوم": "الإثنين",
    "التاريخ": "01/06/2026",
    "الفترة": "11 - 1",
    "الشعبة": 1,
    "القاعة": "C04"
  },
  {
    "رمز المقرر": "EDEN4129",
    "اسم المقرر": "Aspects of Translation",
    "عدد الطلاب": 14,
    "اليوم": "الخميس",
    "التاريخ": "11/06/2026",
    "الفترة": "8:15 - 10:15",
    "الشعبة": 1,
    "القاعة": "D014"
  },
  {
    "رمز المقرر": "EDEN4129",
    "اسم المقرر": "Aspects of Translation",
    "عدد الطلاب": 7,
    "اليوم": "الخميس",
    "التاريخ": "11/06/2026",
    "الفترة": "8:15 - 10:15",
    "الشعبة": 2,
    "القاعة": "D014"
  },
  {
    "رمز المقرر": "EDEN4131",
    "اسم المقرر": "Language, Culture, and Identity",
    "عدد الطلاب": 28,
    "اليوم": "الأربعاء",
    "التاريخ": "03/06/2026",
    "الفترة": "8:15 - 10:15",
    "الشعبة": 1,
    "القاعة": "D013"
  },
  {
    "رمز المقرر": "EDEN4232",
    "اسم المقرر": "Autonomy and Differentiation in ELT",
    "عدد الطلاب": 22,
    "اليوم": "الأحد",
    "التاريخ": "07/06/2026",
    "الفترة": "8:15 - 10:15",
    "الشعبة": 1,
    "القاعة": "D112"
  },
  {
    "رمز المقرر": "EDEN4232",
    "اسم المقرر": "Autonomy and Differentiation in ELT",
    "عدد الطلاب": 29,
    "اليوم": "الأحد",
    "التاريخ": "07/06/2026",
    "الفترة": "8:15 - 10:15",
    "الشعبة": 2,
    "القاعة": "D012"
  },
  {
    "رمز المقرر": "EDEN4234",
    "اسم المقرر": "Computer-Assisted Translation",
    "عدد الطلاب": 22,
    "اليوم": "الإثنين",
    "التاريخ": "01/06/2026",
    "الفترة": "8:15 - 10:15",
    "الشعبة": 1,
    "القاعة": "D109"
  },
  {
    "رمز المقرر": "EDEP1203",
    "اسم المقرر": "علم النفس التربوي",
    "عدد الطلاب": 33,
    "اليوم": "الخميس",
    "التاريخ": "04/06/2026",
    "الفترة": "11 - 1",
    "الشعبة": 1,
    "القاعة": "D05"
  },
  {
    "رمز المقرر": "EDEP1203",
    "اسم المقرر": "علم النفس التربوي",
    "عدد الطلاب": 24,
    "اليوم": "الخميس",
    "التاريخ": "04/06/2026",
    "الفترة": "11 - 1",
    "الشعبة": 2,
    "القاعة": "D07"
  },
  {
    "رمز المقرر": "EDEP1203",
    "اسم المقرر": "علم النفس التربوي",
    "عدد الطلاب": 11,
    "اليوم": "الخميس",
    "التاريخ": "04/06/2026",
    "الفترة": "11 - 1",
    "الشعبة": 3,
    "القاعة": "D05"
  },
  {
    "رمز المقرر": "EDEP1203",
    "اسم المقرر": "علم النفس التربوي",
    "عدد الطلاب": 10,
    "اليوم": "الخميس",
    "التاريخ": "04/06/2026",
    "الفترة": "11 - 1",
    "الشعبة": 4,
    "القاعة": "D05"
  },
  {
    "رمز المقرر": "EDEP1203",
    "اسم المقرر": "علم النفس التربوي",
    "عدد الطلاب": 28,
    "اليوم": "الخميس",
    "التاريخ": "04/06/2026",
    "الفترة": "11 - 1",
    "الشعبة": 5,
    "القاعة": "D014"
  },
  {
    "رمز المقرر": "EDEP1203",
    "اسم المقرر": "علم النفس التربوي",
    "عدد الطلاب": 29,
    "اليوم": "الخميس",
    "التاريخ": "04/06/2026",
    "الفترة": "11 - 1",
    "الشعبة": 6,
    "القاعة": "D012"
  },
  {
    "رمز المقرر": "EDEP1204",
    "اسم المقرر": "Educational Psychology",
    "عدد الطلاب": 17,
    "اليوم": "الخميس",
    "التاريخ": "04/06/2026",
    "الفترة": "11 - 1",
    "الشعبة": 1,
    "القاعة": "D113"
  },
  {
    "رمز المقرر": "EDEP1204",
    "اسم المقرر": "Educational Psychology",
    "عدد الطلاب": 28,
    "اليوم": "الخميس",
    "التاريخ": "04/06/2026",
    "الفترة": "11 - 1",
    "الشعبة": 2,
    "القاعة": "D013"
  },
  {
    "رمز المقرر": "EDMA1203",
    "اسم المقرر": "الرياضيات الأساسية 1",
    "عدد الطلاب": 18,
    "اليوم": "السبت",
    "التاريخ": "06/06/2026",
    "الفترة": "8:15 - 10:15",
    "الشعبة": 1,
    "القاعة": "D114"
  },
  {
    "رمز المقرر": "EDMA1203",
    "اسم المقرر": "الرياضيات الأساسية 1",
    "عدد الطلاب": 21,
    "اليوم": "السبت",
    "التاريخ": "06/06/2026",
    "الفترة": "8:15 - 10:15",
    "الشعبة": 2,
    "القاعة": "D014"
  },
  {
    "رمز المقرر": "EDMA1203",
    "اسم المقرر": "الرياضيات الأساسية 1",
    "عدد الطلاب": 27,
    "اليوم": "السبت",
    "التاريخ": "06/06/2026",
    "الفترة": "8:15 - 10:15",
    "الشعبة": 3,
    "القاعة": "D013"
  },
  {
    "رمز المقرر": "EDMA1203",
    "اسم المقرر": "الرياضيات الأساسية 1",
    "عدد الطلاب": 18,
    "اليوم": "السبت",
    "التاريخ": "06/06/2026",
    "الفترة": "8:15 - 10:15",
    "الشعبة": 4,
    "القاعة": "D113"
  },
  {
    "رمز المقرر": "EDMA1204",
    "اسم المقرر": "الرياضيات للمعلمين 1",
    "عدد الطلاب": 28,
    "اليوم": "الأربعاء",
    "التاريخ": "03/06/2026",
    "الفترة": "8:15 - 10:15",
    "الشعبة": 1,
    "القاعة": "D012"
  },
  {
    "رمز المقرر": "EDMA1204",
    "اسم المقرر": "الرياضيات للمعلمين 1",
    "عدد الطلاب": 24,
    "اليوم": "الأربعاء",
    "التاريخ": "03/06/2026",
    "الفترة": "8:15 - 10:15",
    "الشعبة": 2,
    "القاعة": "D014"
  },
  {
    "رمز المقرر": "EDMA1205",
    "اسم المقرر": "الجبر الخطي 1",
    "عدد الطلاب": 31,
    "اليوم": "الإثنين",
    "التاريخ": "01/06/2026",
    "الفترة": "8:15 - 10:15",
    "الشعبة": 1,
    "القاعة": "D112"
  },
  {
    "رمز المقرر": "EDMA1205",
    "اسم المقرر": "الجبر الخطي 1",
    "عدد الطلاب": 24,
    "اليوم": "الإثنين",
    "التاريخ": "01/06/2026",
    "الفترة": "8:15 - 10:15",
    "الشعبة": 2,
    "القاعة": "D104"
  },
  {
    "رمز المقرر": "EDMA1206",
    "اسم المقرر": "الحسبان 1",
    "عدد الطلاب": 31,
    "اليوم": "السبت",
    "التاريخ": "06/06/2026",
    "الفترة": "8:15 - 10:15",
    "الشعبة": 1,
    "القاعة": "D112"
  },
  {
    "رمز المقرر": "EDMA1206",
    "اسم المقرر": "الحسبان 1",
    "عدد الطلاب": 27,
    "اليوم": "السبت",
    "التاريخ": "06/06/2026",
    "الفترة": "8:15 - 10:15",
    "الشعبة": 2,
    "القاعة": "D012"
  },
  {
    "رمز المقرر": "EDMA2107",
    "اسم المقرر": "الرياضيات الأساسية 2",
    "عدد الطلاب": 19,
    "اليوم": "السبت",
    "التاريخ": "06/06/2026",
    "الفترة": "8:15 - 10:15",
    "الشعبة": 1,
    "القاعة": "D09"
  },
  {
    "رمز المقرر": "EDMA2109",
    "اسم المقرر": "الحسبان 2",
    "عدد الطلاب": 10,
    "اليوم": "الأحد",
    "التاريخ": "31/05/2026",
    "الفترة": "8:15 - 10:45",
    "الشعبة": 1,
    "القاعة": "D112"
  },
  {
    "رمز المقرر": "EDMA2213",
    "اسم المقرر": "الحسبان 3",
    "عدد الطلاب": 16,
    "اليوم": "الإثنين",
    "التاريخ": "08/06/2026",
    "الفترة": "11 - 1",
    "الشعبة": 1,
    "القاعة": "D05"
  },
  {
    "رمز المقرر": "EDMA2213",
    "اسم المقرر": "الحسبان 3",
    "عدد الطلاب": 35,
    "اليوم": "الإثنين",
    "التاريخ": "08/06/2026",
    "الفترة": "11 - 1",
    "الشعبة": 2,
    "القاعة": "D05"
  },
  {
    "رمز المقرر": "EDMA2215",
    "اسم المقرر": "المعادلات التفاضلية العادية",
    "عدد الطلاب": 20,
    "اليوم": "الثلاثاء",
    "التاريخ": "02/06/2026",
    "الفترة": "8:15 - 10:15",
    "الشعبة": 2,
    "القاعة": "D110"
  },
  {
    "رمز المقرر": "EDMA2215",
    "اسم المقرر": "المعادلات التفاضلية العادية",
    "عدد الطلاب": 29,
    "اليوم": "الثلاثاء",
    "التاريخ": "02/06/2026",
    "الفترة": "8:15 - 10:15",
    "الشعبة": 3,
    "القاعة": "D012"
  },
  {
    "رمز المقرر": "EDMA2215",
    "اسم المقرر": "المعادلات التفاضلية العادية",
    "عدد الطلاب": 29,
    "اليوم": "الثلاثاء",
    "التاريخ": "02/06/2026",
    "الفترة": "8:15 - 10:15",
    "الشعبة": 4,
    "القاعة": "D013"
  },
  {
    "رمز المقرر": "EDMA3116",
    "اسم المقرر": "الطرق الرياضية",
    "عدد الطلاب": 4,
    "اليوم": "الخميس",
    "التاريخ": "04/06/2026",
    "الفترة": "8:15 - 10:15",
    "الشعبة": 1,
    "القاعة": "D012"
  },
  {
    "رمز المقرر": "EDMA3220",
    "اسم المقرر": "الهندسة 2",
    "عدد الطلاب": 19,
    "اليوم": "الأربعاء",
    "التاريخ": "03/06/2026",
    "الفترة": "11 - 1",
    "الشعبة": 1,
    "القاعة": "D014"
  },
  {
    "رمز المقرر": "EDMA3220",
    "اسم المقرر": "الهندسة 2",
    "عدد الطلاب": 36,
    "اليوم": "الأربعاء",
    "التاريخ": "03/06/2026",
    "الفترة": "11 - 1",
    "الشعبة": 2,
    "القاعة": "C04"
  },
  {
    "رمز المقرر": "EDMA3221",
    "اسم المقرر": "المعادلات التفاضلية الجزئية",
    "عدد الطلاب": 20,
    "اليوم": "الأحد",
    "التاريخ": "31/05/2026",
    "الفترة": "8:15 - 10:15",
    "الشعبة": 1,
    "القاعة": "D113"
  },
  {
    "رمز المقرر": "EDMA3221",
    "اسم المقرر": "المعادلات التفاضلية الجزئية",
    "عدد الطلاب": 20,
    "اليوم": "الأحد",
    "التاريخ": "31/05/2026",
    "الفترة": "8:15 - 10:15",
    "الشعبة": 2,
    "القاعة": "D110"
  },
  {
    "رمز المقرر": "EDMA3222",
    "اسم المقرر": "مبادئ الإحصاء الرياضي",
    "عدد الطلاب": 22,
    "اليوم": "الأربعاء",
    "التاريخ": "10/06/2026",
    "الفترة": "8:15 - 10:15",
    "الشعبة": 1,
    "القاعة": "C04"
  },
  {
    "رمز المقرر": "EDMA3222",
    "اسم المقرر": "مبادئ الإحصاء الرياضي",
    "عدد الطلاب": 20,
    "اليوم": "الأربعاء",
    "التاريخ": "10/06/2026",
    "الفترة": "8:15 - 10:15",
    "الشعبة": 2,
    "القاعة": "C04"
  },
  {
    "رمز المقرر": "EDMA4230",
    "اسم المقرر": "الرياضيات للمعلمين 2",
    "عدد الطلاب": 27,
    "اليوم": "الخميس",
    "التاريخ": "11/06/2026",
    "الفترة": "11 - 1",
    "الشعبة": 1,
    "القاعة": "D013"
  },
  {
    "رمز المقرر": "EDMA4230",
    "اسم المقرر": "الرياضيات للمعلمين 2",
    "عدد الطلاب": 14,
    "اليوم": "الخميس",
    "التاريخ": "11/06/2026",
    "الفترة": "11 - 1",
    "الشعبة": 2,
    "القاعة": "D09"
  },
  {
    "رمز المقرر": "EDMA4231",
    "اسم المقرر": "التحليل العددي",
    "عدد الطلاب": 19,
    "اليوم": "الإثنين",
    "التاريخ": "08/06/2026",
    "الفترة": "11 - 1",
    "الشعبة": 1,
    "القاعة": "D112"
  },
  {
    "رمز المقرر": "EDMA4231",
    "اسم المقرر": "التحليل العددي",
    "عدد الطلاب": 12,
    "اليوم": "الإثنين",
    "التاريخ": "08/06/2026",
    "الفترة": "11 - 1",
    "الشعبة": 2,
    "القاعة": "D112"
  },
  {
    "رمز المقرر": "EDMA4232",
    "اسم المقرر": "التحليل الدالي",
    "عدد الطلاب": 14,
    "اليوم": "الإثنين",
    "التاريخ": "25/05/2026",
    "الفترة": "8:15 - 10:15",
    "الشعبة": 1,
    "القاعة": "D05"
  },
  {
    "رمز المقرر": "EDMA4233",
    "اسم المقرر": "أساليب المعاينة",
    "عدد الطلاب": 17,
    "اليوم": "الإثنين",
    "التاريخ": "25/05/2026",
    "الفترة": "8:15 - 10:15",
    "الشعبة": 1,
    "القاعة": "D05"
  },
  {
    "رمز المقرر": "EDPH1101",
    "اسم المقرر": "الفيزياء العامة 1",
    "عدد الطلاب": 18,
    "اليوم": "الخميس",
    "التاريخ": "11/06/2026",
    "الفترة": "11 - 1",
    "الشعبة": 1,
    "القاعة": "D07"
  },
  {
    "رمز المقرر": "EDPH1102",
    "اسم المقرر": "الفيزياء العامة للأحياء 1",
    "عدد الطلاب": 1,
    "اليوم": "الخميس",
    "التاريخ": "11/06/2026",
    "الفترة": "11 - 1",
    "الشعبة": 1,
    "القاعة": "D013"
  },
  {
    "رمز المقرر": "EDPH1103",
    "اسم المقرر": "الفيزياء العامة للكيمياء 1",
    "عدد الطلاب": 1,
    "اليوم": "الخميس",
    "التاريخ": "11/06/2026",
    "الفترة": "11 - 1",
    "الشعبة": 1,
    "القاعة": "D013"
  },
  {
    "رمز المقرر": "EDPH1205",
    "اسم المقرر": "الفيزياء العامة 2",
    "عدد الطلاب": 23,
    "اليوم": "الخميس",
    "التاريخ": "04/06/2026",
    "الفترة": "8:15 - 10:15",
    "الشعبة": 1,
    "القاعة": "D012"
  },
  {
    "رمز المقرر": "EDPH1205",
    "اسم المقرر": "الفيزياء العامة 2",
    "عدد الطلاب": 10,
    "اليوم": "الخميس",
    "التاريخ": "04/06/2026",
    "الفترة": "8:15 - 10:15",
    "الشعبة": 2,
    "القاعة": "D013"
  },
  {
    "رمز المقرر": "EDPH1206",
    "اسم المقرر": "الفيزياء العامة للأحياء 2",
    "عدد الطلاب": 28,
    "اليوم": "الخميس",
    "التاريخ": "11/06/2026",
    "الفترة": "11 - 1",
    "الشعبة": 1,
    "القاعة": "D012"
  },
  {
    "رمز المقرر": "EDPH1206",
    "اسم المقرر": "الفيزياء العامة للأحياء 2",
    "عدد الطلاب": 12,
    "اليوم": "الخميس",
    "التاريخ": "11/06/2026",
    "الفترة": "11 - 1",
    "الشعبة": 2,
    "القاعة": "D07"
  },
  {
    "رمز المقرر": "EDPH1207",
    "اسم المقرر": "الفيزياء العامة للكيمياء 2",
    "عدد الطلاب": 26,
    "اليوم": "الأربعاء",
    "التاريخ": "10/06/2026",
    "الفترة": "8:15 - 10:15",
    "الشعبة": 1,
    "القاعة": "D07"
  },
  {
    "رمز المقرر": "EDPH1207",
    "اسم المقرر": "الفيزياء العامة للكيمياء 2",
    "عدد الطلاب": 12,
    "اليوم": "الأربعاء",
    "التاريخ": "10/06/2026",
    "الفترة": "8:15 - 10:15",
    "الشعبة": 2,
    "القاعة": "D05"
  },
  {
    "رمز المقرر": "EDPH2211",
    "اسم المقرر": "الثيرموديناميك",
    "عدد الطلاب": 24,
    "اليوم": "الخميس",
    "التاريخ": "11/06/2026",
    "الفترة": "8:15 - 10:15",
    "الشعبة": 1,
    "القاعة": "D013"
  },
  {
    "رمز المقرر": "EDPH2211",
    "اسم المقرر": "الثيرموديناميك",
    "عدد الطلاب": 20,
    "اليوم": "الخميس",
    "التاريخ": "11/06/2026",
    "الفترة": "8:15 - 10:15",
    "الشعبة": 2,
    "القاعة": "D09"
  },
  {
    "رمز المقرر": "EDPH2212",
    "اسم المقرر": "الدوائر الكهربائية",
    "عدد الطلاب": 28,
    "اليوم": "الإثنين",
    "التاريخ": "25/05/2026",
    "الفترة": "8:15 - 10:15",
    "الشعبة": 1,
    "القاعة": "D012"
  },
  {
    "رمز المقرر": "EDPH2212",
    "اسم المقرر": "الدوائر الكهربائية",
    "عدد الطلاب": 20,
    "اليوم": "الإثنين",
    "التاريخ": "25/05/2026",
    "الفترة": "8:15 - 10:15",
    "الشعبة": 2,
    "القاعة": "D013"
  },
  {
    "رمز المقرر": "EDPH2226",
    "اسم المقرر": "الفيزياء العامة للرياضيات",
    "عدد الطلاب": 13,
    "اليوم": "السبت",
    "التاريخ": "06/06/2026",
    "الفترة": "11 - 1",
    "الشعبة": 1,
    "القاعة": "D07"
  },
  {
    "رمز المقرر": "EDPH2226",
    "اسم المقرر": "الفيزياء العامة للرياضيات",
    "عدد الطلاب": 30,
    "اليوم": "السبت",
    "التاريخ": "06/06/2026",
    "الفترة": "11 - 1",
    "الشعبة": 2,
    "القاعة": "D012"
  },
  {
    "رمز المقرر": "EDPH3116",
    "اسم المقرر": "الفيزياء الرياضية 1",
    "عدد الطلاب": 4,
    "اليوم": "الخميس",
    "التاريخ": "11/06/2026",
    "الفترة": "8:15 - 10:15",
    "الشعبة": 1,
    "القاعة": "D09"
  },
  {
    "رمز المقرر": "EDPH3217",
    "اسم المقرر": "فيزياء الحالة الصلبة",
    "عدد الطلاب": 13,
    "اليوم": "الإثنين",
    "التاريخ": "01/06/2026",
    "الفترة": "8:15 - 10:15",
    "الشعبة": 1,
    "القاعة": "D114"
  },
  {
    "رمز المقرر": "EDPH3217",
    "اسم المقرر": "فيزياء الحالة الصلبة",
    "عدد الطلاب": 26,
    "اليوم": "الإثنين",
    "التاريخ": "01/06/2026",
    "الفترة": "8:15 - 10:15",
    "الشعبة": 2,
    "القاعة": "D012"
  },
  {
    "رمز المقرر": "EDPH3218",
    "اسم المقرر": "النظرية الكهرومغناطيسية",
    "عدد الطلاب": 31,
    "اليوم": "الأربعاء",
    "التاريخ": "10/06/2026",
    "الفترة": "8:15 - 10:15",
    "الشعبة": 1,
    "القاعة": "D05"
  },
  {
    "رمز المقرر": "EDPH3219",
    "اسم المقرر": "الفيزياء الذرية والأطياف",
    "عدد الطلاب": 14,
    "اليوم": "الخميس",
    "التاريخ": "04/06/2026",
    "الفترة": "11 - 1",
    "الشعبة": 1,
    "القاعة": "D114"
  },
  {
    "رمز المقرر": "EDPH3219",
    "اسم المقرر": "الفيزياء الذرية والأطياف",
    "عدد الطلاب": 24,
    "اليوم": "الخميس",
    "التاريخ": "04/06/2026",
    "الفترة": "11 - 1",
    "الشعبة": 2,
    "القاعة": "D09"
  },
  {
    "رمز المقرر": "EDPH4120",
    "اسم المقرر": "الفيزياء الرياضية 2",
    "عدد الطلاب": 20,
    "اليوم": "السبت",
    "التاريخ": "06/06/2026",
    "الفترة": "8:15 - 10:15",
    "الشعبة": 1,
    "القاعة": "D07"
  },
  {
    "رمز المقرر": "EDPH4123",
    "اسم المقرر": "فيزياء الليزر والبلازما",
    "عدد الطلاب": 21,
    "اليوم": "الثلاثاء",
    "التاريخ": "02/06/2026",
    "الفترة": "11 - 1",
    "الشعبة": 1,
    "القاعة": "D014"
  },
  {
    "رمز المقرر": "EDPH4222",
    "اسم المقرر": "مقدمة في الفلك والجيولوجيا",
    "عدد الطلاب": 38,
    "اليوم": "الأربعاء",
    "التاريخ": "03/06/2026",
    "الفترة": "8:15 - 10:15",
    "الشعبة": 2,
    "القاعة": "D05"
  },
  {
    "رمز المقرر": "EDPH4222",
    "اسم المقرر": "مقدمة في الفلك والجيولوجيا",
    "عدد الطلاب": 23,
    "اليوم": "الأربعاء",
    "التاريخ": "03/06/2026",
    "الفترة": "8:15 - 10:15",
    "الشعبة": 3,
    "القاعة": "D07"
  },
  {
    "رمز المقرر": "EDPH4224",
    "اسم المقرر": "الفيزياء النووية",
    "عدد الطلاب": 22,
    "اليوم": "الأحد",
    "التاريخ": "31/05/2026",
    "الفترة": "8:15 - 10:15",
    "الشعبة": 1,
    "القاعة": "D109"
  },
  {
    "رمز المقرر": "EDRS1101",
    "اسم المقرر": "مناهج البحث والإحصاء",
    "عدد الطلاب": 20,
    "اليوم": "الأربعاء",
    "التاريخ": "10/06/2026",
    "الفترة": "11 - 1",
    "الشعبة": 1,
    "القاعة": "D113"
  },
  {
    "رمز المقرر": "EDRS1101",
    "اسم المقرر": "مناهج البحث والإحصاء",
    "عدد الطلاب": 30,
    "اليوم": "الأربعاء",
    "التاريخ": "10/06/2026",
    "الفترة": "11 - 1",
    "الشعبة": 2,
    "القاعة": "D012"
  },
  {
    "رمز المقرر": "EDRS2102",
    "اسم المقرر": "Research Methods & Statistics",
    "عدد الطلاب": 53,
    "اليوم": "السبت",
    "التاريخ": "06/06/2026",
    "الفترة": "8:15 - 10:15",
    "الشعبة": 1,
    "القاعة": "D05"
  },
  {
    "رمز المقرر": "EDSM3103",
    "اسم المقرر": "الإدارة المدرسية",
    "عدد الطلاب": 29,
    "اليوم": "الأحد",
    "التاريخ": "24/05/2026",
    "الفترة": "11 - 1",
    "الشعبة": 1,
    "القاعة": "D05"
  },
  {
    "رمز المقرر": "EDSM3103",
    "اسم المقرر": "الإدارة المدرسية",
    "عدد الطلاب": 20,
    "اليوم": "الأحد",
    "التاريخ": "24/05/2026",
    "الفترة": "11 - 1",
    "الشعبة": 2,
    "القاعة": "D05"
  },
  {
    "رمز المقرر": "EDSM3103",
    "اسم المقرر": "الإدارة المدرسية",
    "عدد الطلاب": 23,
    "اليوم": "الأحد",
    "التاريخ": "24/05/2026",
    "الفترة": "11 - 1",
    "الشعبة": 3,
    "القاعة": "D013"
  },
  {
    "رمز المقرر": "EDSM3103",
    "اسم المقرر": "الإدارة المدرسية",
    "عدد الطلاب": 29,
    "اليوم": "الأحد",
    "التاريخ": "24/05/2026",
    "الفترة": "11 - 1",
    "الشعبة": 4,
    "القاعة": "D014"
  },
  {
    "رمز المقرر": "EDSM3103",
    "اسم المقرر": "الإدارة المدرسية",
    "عدد الطلاب": 15,
    "اليوم": "الأحد",
    "التاريخ": "24/05/2026",
    "الفترة": "11 - 1",
    "الشعبة": 5,
    "القاعة": "D112"
  },
  {
    "رمز المقرر": "EDSM3104",
    "اسم المقرر": "School Management",
    "عدد الطلاب": 30,
    "اليوم": "الأحد",
    "التاريخ": "24/05/2026",
    "الفترة": "11 - 1",
    "الشعبة": 1,
    "القاعة": "D012"
  },
  {
    "رمز المقرر": "EDSM3104",
    "اسم المقرر": "School Management",
    "عدد الطلاب": 29,
    "اليوم": "الأحد",
    "التاريخ": "24/05/2026",
    "الفترة": "11 - 1",
    "الشعبة": 2,
    "القاعة": "D07"
  },
  {
    "رمز المقرر": "EDTC2201",
    "اسم المقرر": "تكنولوجيا التعليم للتخصص",
    "عدد الطلاب": 30,
    "اليوم": "الأربعاء",
    "التاريخ": "03/06/2026",
    "الفترة": "11 - 1",
    "الشعبة": 1,
    "القاعة": "D012"
  },
  {
    "رمز المقرر": "EDTC2201",
    "اسم المقرر": "تكنولوجيا التعليم للتخصص",
    "عدد الطلاب": 13,
    "اليوم": "الأربعاء",
    "التاريخ": "03/06/2026",
    "الفترة": "11 - 1",
    "الشعبة": 2,
    "القاعة": "D07"
  },
  {
    "رمز المقرر": "EDTC2201",
    "اسم المقرر": "تكنولوجيا التعليم للتخصص",
    "عدد الطلاب": 39,
    "اليوم": "الأربعاء",
    "التاريخ": "03/06/2026",
    "الفترة": "11 - 1",
    "الشعبة": 4,
    "القاعة": "D05"
  },
  {
    "رمز المقرر": "EDTM2202",
    "اسم المقرر": "طرق تدريس العلوم",
    "عدد الطلاب": 17,
    "اليوم": "الثلاثاء",
    "التاريخ": "09/06/2026",
    "الفترة": "11 - 1",
    "الشعبة": 1,
    "القاعة": "D114"
  },
  {
    "رمز المقرر": "EDTM2202",
    "اسم المقرر": "طرق تدريس العلوم",
    "عدد الطلاب": 27,
    "اليوم": "الثلاثاء",
    "التاريخ": "09/06/2026",
    "الفترة": "11 - 1",
    "الشعبة": 2,
    "القاعة": "D012"
  },
  {
    "رمز المقرر": "EDTM2203",
    "اسم المقرر": "طرق تدريس العلوم",
    "عدد الطلاب": 32,
    "اليوم": "الثلاثاء",
    "التاريخ": "09/06/2026",
    "الفترة": "11 - 1",
    "الشعبة": 1,
    "القاعة": "C03"
  },
  {
    "رمز المقرر": "EDTM2203",
    "اسم المقرر": "طرق تدريس العلوم",
    "عدد الطلاب": 12,
    "اليوم": "الثلاثاء",
    "التاريخ": "09/06/2026",
    "الفترة": "11 - 1",
    "الشعبة": 2,
    "القاعة": "D114"
  },
  {
    "رمز المقرر": "EDTM2204",
    "اسم المقرر": "طرق تدريس العلوم",
    "عدد الطلاب": 20,
    "اليوم": "الثلاثاء",
    "التاريخ": "09/06/2026",
    "الفترة": "11 - 1",
    "الشعبة": 1,
    "القاعة": "D112"
  },
  {
    "رمز المقرر": "EDTM2204",
    "اسم المقرر": "طرق تدريس العلوم",
    "عدد الطلاب": 21,
    "اليوم": "الثلاثاء",
    "التاريخ": "09/06/2026",
    "الفترة": "11 - 1",
    "الشعبة": 2,
    "القاعة": "D09"
  },
  {
    "رمز المقرر": "EDTM2205",
    "اسم المقرر": "طرق تدريس الرياضيات",
    "عدد الطلاب": 26,
    "اليوم": "الثلاثاء",
    "التاريخ": "09/06/2026",
    "الفترة": "11 - 1",
    "الشعبة": 1,
    "القاعة": "D013"
  },
  {
    "رمز المقرر": "EDTM2205",
    "اسم المقرر": "طرق تدريس الرياضيات",
    "عدد الطلاب": 25,
    "اليوم": "الثلاثاء",
    "التاريخ": "09/06/2026",
    "الفترة": "11 - 1",
    "الشعبة": 2,
    "القاعة": "D014"
  },
  {
    "رمز المقرر": "EDTM2206",
    "اسم المقرر": "ELT Methods",
    "عدد الطلاب": 13,
    "اليوم": "الأربعاء",
    "التاريخ": "10/06/2026",
    "الفترة": "11 - 1",
    "الشعبة": 1,
    "القاعة": "D112"
  },
  {
    "رمز المقرر": "EDTM2206",
    "اسم المقرر": "ELT Methods",
    "عدد الطلاب": 25,
    "اليوم": "الأربعاء",
    "التاريخ": "10/06/2026",
    "الفترة": "11 - 1",
    "الشعبة": 2,
    "القاعة": "D014"
  },
  {
    "رمز المقرر": "EDUC800",
    "اسم المقرر": "Administration",
    "عدد الطلاب": 4,
    "اليوم": "الأحد",
    "التاريخ": "24/05/2026",
    "الفترة": "11 - 1",
    "الشعبة": 310,
    "القاعة": "D013"
  },
  {
    "رمز المقرر": "ENSP1212",
    "اسم المقرر": "Phonetics & Phonology",
    "عدد الطلاب": 1,
    "اليوم": "الثلاثاء",
    "التاريخ": "09/06/2026",
    "الفترة": "8:15 - 10:15",
    "الشعبة": 210,
    "القاعة": "D07"
  },
  {
    "رمز المقرر": "ENSP1212",
    "اسم المقرر": "Phonetics & Phonology",
    "عدد الطلاب": 1,
    "اليوم": "الثلاثاء",
    "التاريخ": "09/06/2026",
    "الفترة": "8:15 - 10:15",
    "الشعبة": 220,
    "القاعة": "D07"
  },
  {
    "رمز المقرر": "ENSP2114",
    "اسم المقرر": "Syntax",
    "عدد الطلاب": 1,
    "اليوم": "الثلاثاء",
    "التاريخ": "02/06/2026",
    "الفترة": "11 - 1",
    "الشعبة": 350,
    "القاعة": "D013"
  },
  {
    "رمز المقرر": "ENSP2228",
    "اسم المقرر": "Report",
    "عدد الطلاب": 2,
    "اليوم": "الثلاثاء",
    "التاريخ": "09/06/2026",
    "الفترة": "11 - 1",
    "الشعبة": 110,
    "القاعة": "D05"
  },
  {
    "رمز المقرر": "ENSP2232",
    "اسم المقرر": "Skills Development",
    "عدد الطلاب": 2,
    "اليوم": "الإثنين",
    "التاريخ": "08/06/2026",
    "الفترة": "8:15 - 10:15",
    "الشعبة": 240,
    "القاعة": "D013"
  },
  {
    "رمز المقرر": "ENSP2232",
    "اسم المقرر": "Skills Development",
    "عدد الطلاب": 1,
    "اليوم": "الإثنين",
    "التاريخ": "08/06/2026",
    "الفترة": "8:15 - 10:15",
    "الشعبة": 250,
    "القاعة": "D07"
  },
  {
    "رمز المقرر": "ENSP3116",
    "اسم المقرر": "General Translation",
    "عدد الطلاب": 5,
    "اليوم": "الخميس",
    "التاريخ": "11/06/2026",
    "الفترة": "8:15 - 10:15",
    "الشعبة": 410,
    "القاعة": "D014"
  },
  {
    "رمز المقرر": "ENSP3116",
    "اسم المقرر": "General Translation",
    "عدد الطلاب": 1,
    "اليوم": "الخميس",
    "التاريخ": "11/06/2026",
    "الفترة": "8:15 - 10:15",
    "الشعبة": 420,
    "القاعة": "D014"
  },
  {
    "رمز المقرر": "ENSP3135",
    "اسم المقرر": "Vocabulary & Grammar",
    "عدد الطلاب": 1,
    "اليوم": "الأربعاء",
    "التاريخ": "10/06/2026",
    "الفترة": "11 - 1",
    "الشعبة": 240,
    "القاعة": "D013"
  },
  {
    "رمز المقرر": "ENSP3135",
    "اسم المقرر": "Vocabulary & Grammar",
    "عدد الطلاب": 1,
    "اليوم": "الأربعاء",
    "التاريخ": "10/06/2026",
    "الفترة": "11 - 1",
    "الشعبة": 250,
    "القاعة": "D013"
  },
  {
    "رمز المقرر": "ENSP3135",
    "اسم المقرر": "Vocabulary & Grammar",
    "عدد الطلاب": 1,
    "اليوم": "الأربعاء",
    "التاريخ": "10/06/2026",
    "الفترة": "11 - 1",
    "الشعبة": 350,
    "القاعة": "D013"
  },
  {
    "رمز المقرر": "ENSP3213",
    "اسم المقرر": "Discourse",
    "عدد الطلاب": 4,
    "اليوم": "الإثنين",
    "التاريخ": "01/06/2026",
    "الفترة": "11 - 1",
    "الشعبة": 340,
    "القاعة": "D012"
  },
  {
    "رمز المقرر": "ENSP4143",
    "اسم المقرر": "Learning Strategies",
    "عدد الطلاب": 6,
    "اليوم": "الأحد",
    "التاريخ": "07/06/2026",
    "الفترة": "8:15 - 10:15",
    "الشعبة": 430,
    "القاعة": "D112"
  },
  {
    "رمز المقرر": "ENSP4152",
    "اسم المقرر": "Children's Literature",
    "عدد الطلاب": 1,
    "اليوم": "الأربعاء",
    "التاريخ": "03/06/2026",
    "الفترة": "8:15 - 10:15",
    "الشعبة": 250,
    "القاعة": "D013"
  },
  {
    "رمز المقرر": "ENSP4245",
    "اسم المقرر": "ELT",
    "عدد الطلاب": 1,
    "اليوم": "الإثنين",
    "التاريخ": "01/06/2026",
    "الفترة": "8:15 - 10:15",
    "الشعبة": 210,
    "القاعة": "D013"
  },
  {
    "رمز المقرر": "FPCS0001",
    "اسم المقرر": "Computing Skill",
    "عدد الطلاب": 11,
    "اليوم": "الإثنين",
    "التاريخ": "08/06/2026",
    "الفترة": "9 - 11",
    "الشعبة": 2,
    "القاعة": "C110"
  },
  {
    "رمز المقرر": "FPCS1204",
    "اسم المقرر": "مهارات الحاسوب",
    "عدد الطلاب": 16,
    "اليوم": "الأحد",
    "التاريخ": "24/05/2026",
    "الفترة": "8:15 - 10:15",
    "الشعبة": 1,
    "القاعة": "C110"
  },
  {
    "رمز المقرر": "FPCS1204",
    "اسم المقرر": "مهارات الحاسوب",
    "عدد الطلاب": 16,
    "اليوم": "الأحد",
    "التاريخ": "24/05/2026",
    "الفترة": "8:15 - 10:15",
    "الشعبة": 2,
    "القاعة": "C110"
  },
  {
    "رمز المقرر": "FPCS1204",
    "اسم المقرر": "مهارات الحاسوب",
    "عدد الطلاب": 24,
    "اليوم": "الأحد",
    "التاريخ": "24/05/2026",
    "الفترة": "8:15 - 10:15",
    "الشعبة": 3,
    "القاعة": "C106"
  },
  {
    "رمز المقرر": "FPCS1204",
    "اسم المقرر": "مهارات الحاسوب",
    "عدد الطلاب": 27,
    "اليوم": "الأحد",
    "التاريخ": "24/05/2026",
    "الفترة": "8:15 - 10:15",
    "الشعبة": 4,
    "القاعة": "C107"
  },
  {
    "رمز المقرر": "FPCS1204",
    "اسم المقرر": "مهارات الحاسوب",
    "عدد الطلاب": 26,
    "اليوم": "الأحد",
    "التاريخ": "24/05/2026",
    "الفترة": "8:15 - 10:15",
    "الشعبة": 5,
    "القاعة": "C104"
  },
  {
    "رمز المقرر": "FPCS1204",
    "اسم المقرر": "مهارات الحاسوب",
    "عدد الطلاب": 15,
    "اليوم": "الأحد",
    "التاريخ": "24/05/2026",
    "الفترة": "8:15 - 10:15",
    "الشعبة": 6,
    "القاعة": "C108"
  },
  {
    "رمز المقرر": "FPGE0002",
    "اسم المقرر": "General English 2",
    "عدد الطلاب": 7,
    "اليوم": "الأربعاء",
    "التاريخ": "03/06/2026",
    "الفترة": "9 - 11:35",
    "الشعبة": 1,
    "القاعة": "D112"
  },
  {
    "رمز المقرر": "FPGE0003",
    "اسم المقرر": "General English 3",
    "عدد الطلاب": 19,
    "اليوم": "الثلاثاء",
    "التاريخ": "02/06/2026",
    "الفترة": "9 - 11:40",
    "الشعبة": 1,
    "القاعة": "D114"
  },
  {
    "رمز المقرر": "FPGE0003",
    "اسم المقرر": "General English 3",
    "عدد الطلاب": 22,
    "اليوم": "الثلاثاء",
    "التاريخ": "02/06/2026",
    "الفترة": "9 - 11:40",
    "الشعبة": 2,
    "القاعة": "D112"
  },
  {
    "رمز المقرر": "FPMA1002",
    "اسم المقرر": "Pure Mathematics",
    "عدد الطلاب": 1,
    "اليوم": "الإثنين",
    "التاريخ": "25/05/2026",
    "الفترة": "11 - 1",
    "الشعبة": 870,
    "القاعة": "C03"
  },
  {
    "رمز المقرر": "FPMA1203",
    "اسم المقرر": "الرياضيات البحتة",
    "عدد الطلاب": 22,
    "اليوم": "الإثنين",
    "التاريخ": "25/05/2026",
    "الفترة": "11 - 1",
    "الشعبة": 1,
    "القاعة": "D109"
  },
  {
    "رمز المقرر": "FPMA1203",
    "اسم المقرر": "الرياضيات البحتة",
    "عدد الطلاب": 25,
    "اليوم": "الإثنين",
    "التاريخ": "25/05/2026",
    "الفترة": "11 - 1",
    "الشعبة": 2,
    "القاعة": "D014"
  },
  {
    "رمز المقرر": "FPMA1203",
    "اسم المقرر": "الرياضيات البحتة",
    "عدد الطلاب": 24,
    "اليوم": "الإثنين",
    "التاريخ": "25/05/2026",
    "الفترة": "11 - 1",
    "الشعبة": 4,
    "القاعة": "D07"
  },
  {
    "رمز المقرر": "FPMA1203",
    "اسم المقرر": "الرياضيات البحتة",
    "عدد الطلاب": 36,
    "اليوم": "الإثنين",
    "التاريخ": "25/05/2026",
    "الفترة": "11 - 1",
    "الشعبة": 5,
    "القاعة": "C03"
  },
  {
    "رمز المقرر": "FPMA1203",
    "اسم المقرر": "الرياضيات البحتة",
    "عدد الطلاب": 27,
    "اليوم": "الإثنين",
    "التاريخ": "25/05/2026",
    "الفترة": "11 - 1",
    "الشعبة": 6,
    "القاعة": "D013"
  },
  {
    "رمز المقرر": "FPMB1102",
    "اسم المقرر": "مقدمة في الرياضيات",
    "عدد الطلاب": 22,
    "اليوم": "الإثنين",
    "التاريخ": "25/05/2026",
    "الفترة": "11 - 1",
    "الشعبة": 1,
    "القاعة": "D113"
  },
  {
    "رمز المقرر": "FPMH0001",
    "اسم المقرر": "Mathematics For Social Sciences",
    "عدد الطلاب": 16,
    "اليوم": "الأحد",
    "التاريخ": "07/06/2026",
    "الفترة": "9 - 11",
    "الشعبة": 1,
    "القاعة": "C03"
  },
  {
    "رمز المقرر": "FPMH0001",
    "اسم المقرر": "Mathematics For Social Sciences",
    "عدد الطلاب": 18,
    "اليوم": "الأحد",
    "التاريخ": "07/06/2026",
    "الفترة": "9 - 11",
    "الشعبة": 2,
    "القاعة": "C03"
  },
  {
    "رمز المقرر": "FPSS1001",
    "اسم المقرر": "Learning Skills",
    "عدد الطلاب": 1,
    "اليوم": "الخميس",
    "التاريخ": "11/06/2026",
    "الفترة": "8:15 - 10:15",
    "الشعبة": 870,
    "القاعة": "C04"
  },
  {
    "رمز المقرر": "FPSS1001",
    "اسم المقرر": "Learning Skills",
    "عدد الطلاب": 2,
    "اليوم": "الخميس",
    "التاريخ": "11/06/2026",
    "الفترة": "8:15 - 10:15",
    "الشعبة": 880,
    "القاعة": "C04"
  },
  {
    "رمز المقرر": "FPSS1101",
    "اسم المقرر": "مهارات التعلم",
    "عدد الطلاب": 22,
    "اليوم": "الخميس",
    "التاريخ": "11/06/2026",
    "الفترة": "8:15 - 10:15",
    "الشعبة": 1,
    "القاعة": "C04"
  },
  {
    "رمز المقرر": "FPSS1101",
    "اسم المقرر": "مهارات التعلم",
    "عدد الطلاب": 22,
    "اليوم": "الخميس",
    "التاريخ": "11/06/2026",
    "الفترة": "8:15 - 10:15",
    "الشعبة": 2,
    "القاعة": "D07"
  },
  {
    "رمز المقرر": "HIST1008",
    "اسم المقرر": "Oman Across History",
    "عدد الطلاب": 1,
    "اليوم": "الأحد",
    "التاريخ": "31/05/2026",
    "الفترة": "11 - 1",
    "الشعبة": 340,
    "القاعة": "D012"
  },
  {
    "رمز المقرر": "PSYC240",
    "اسم المقرر": "Developmental",
    "عدد الطلاب": 1,
    "اليوم": "الإثنين",
    "التاريخ": "25/05/2026",
    "الفترة": "11 - 1",
    "الشعبة": 420,
    "القاعة": "C04"
  },
  {
    "رمز المقرر": "PSYC250",
    "اسم المقرر": "Assessment",
    "عدد الطلاب": 2,
    "اليوم": "الثلاثاء",
    "التاريخ": "02/06/2026",
    "الفترة": "11 - 1",
    "الشعبة": 310,
    "القاعة": "D013"
  },
  {
    "رمز المقرر": "PSYC250",
    "اسم المقرر": "Assessment",
    "عدد الطلاب": 3,
    "اليوم": "الثلاثاء",
    "التاريخ": "02/06/2026",
    "الفترة": "11 - 1",
    "الشعبة": 320,
    "القاعة": "D013"
  },
  {
    "رمز المقرر": "PSYC4138",
    "اسم المقرر": "Research Methodology",
    "عدد الطلاب": 3,
    "اليوم": "السبت",
    "التاريخ": "06/06/2026",
    "الفترة": "8:15 - 10:15",
    "الشعبة": 210,
    "القاعة": "D012"
  },
  {
    "رمز المقرر": "TPBI1003",
    "اسم المقرر": "Introduction to Botany",
    "عدد الطلاب": 1,
    "اليوم": "الثلاثاء",
    "التاريخ": "09/06/2026",
    "الفترة": "8:15 - 10:15",
    "الشعبة": 860,
    "القاعة": "D013"
  },
  {
    "رمز المقرر": "TPBI2010",
    "اسم المقرر": "Vertebrates and Human Body",
    "عدد الطلاب": 1,
    "اليوم": "الخميس",
    "التاريخ": "04/06/2026",
    "الفترة": "11 - 1",
    "الشعبة": 610,
    "القاعة": "D114"
  },
  {
    "رمز المقرر": "TPBI3012",
    "اسم المقرر": "Plant Taxonomy (2)",
    "عدد الطلاب": 1,
    "اليوم": "الأربعاء",
    "التاريخ": "10/06/2026",
    "الفترة": "8:15 - 10:15",
    "الشعبة": 610,
    "القاعة": "D09"
  },
  {
    "رمز المقرر": "TPBI3014",
    "اسم المقرر": "Microbiology",
    "عدد الطلاب": 2,
    "اليوم": "الإثنين",
    "التاريخ": "01/06/2026",
    "الفترة": "8:15 - 10:15",
    "الشعبة": 710,
    "القاعة": "D09"
  },
  {
    "رمز المقرر": "TPBI3015",
    "اسم المقرر": "Animal Physiology (2)",
    "عدد الطلاب": 1,
    "اليوم": "الأحد",
    "التاريخ": "24/05/2026",
    "الفترة": "8:15 - 10:15",
    "الشعبة": 610,
    "القاعة": "D07"
  },
  {
    "رمز المقرر": "TPBI3017",
    "اسم المقرر": "Plant Physiology",
    "عدد الطلاب": 2,
    "اليوم": "الأحد",
    "التاريخ": "31/05/2026",
    "الفترة": "8:15 - 10:15",
    "الشعبة": 620,
    "القاعة": "D013"
  },
  {
    "رمز المقرر": "TPBI3018",
    "اسم المقرر": "Genetics",
    "عدد الطلاب": 1,
    "اليوم": "الثلاثاء",
    "التاريخ": "02/06/2026",
    "الفترة": "8:15 - 10:15",
    "الشعبة": 610,
    "القاعة": "D05"
  },
  {
    "رمز المقرر": "TPBI4020",
    "اسم المقرر": "Parasitology and Immunology",
    "عدد الطلاب": 4,
    "اليوم": "الأحد",
    "التاريخ": "24/05/2026",
    "الفترة": "8:15 - 10:15",
    "الشعبة": 710,
    "القاعة": "D09"
  },
  {
    "رمز المقرر": "TPBI4021",
    "اسم المقرر": "Genetic Engineering",
    "عدد الطلاب": 5,
    "اليوم": "الإثنين",
    "التاريخ": "08/06/2026",
    "الفترة": "8:15 - 10:15",
    "الشعبة": 710,
    "القاعة": "D09"
  },
  {
    "رمز المقرر": "TPBI4023",
    "اسم المقرر": "Food and Nutrition",
    "عدد الطلاب": 2,
    "اليوم": "الإثنين",
    "التاريخ": "01/06/2026",
    "الفترة": "8:15 - 10:15",
    "الشعبة": 710,
    "القاعة": "D110"
  },
  {
    "رمز المقرر": "TPCH1002",
    "اسم المقرر": "Chemistry 2",
    "عدد الطلاب": 1,
    "اليوم": "الإثنين",
    "التاريخ": "01/06/2026",
    "الفترة": "8:15 - 10:15",
    "الشعبة": 850,
    "القاعة": "D012"
  },
  {
    "رمز المقرر": "TPCH1002",
    "اسم المقرر": "Chemistry 2",
    "عدد الطلاب": 2,
    "اليوم": "الإثنين",
    "التاريخ": "01/06/2026",
    "الفترة": "8:15 - 10:15",
    "الشعبة": 860,
    "القاعة": "D014"
  },
  {
    "رمز المقرر": "TPCH2008",
    "اسم المقرر": "Physical Chemistry",
    "عدد الطلاب": 1,
    "اليوم": "الإثنين",
    "التاريخ": "25/05/2026",
    "الفترة": "11 - 1",
    "الشعبة": 530,
    "القاعة": "D012"
  },
  {
    "رمز المقرر": "TPCH2009",
    "اسم المقرر": "Inorganic Chemistry",
    "عدد الطلاب": 1,
    "اليوم": "الإثنين",
    "التاريخ": "01/06/2026",
    "الفترة": "11 - 1",
    "الشعبة": 540,
    "القاعة": "D013"
  },
  {
    "رمز المقرر": "TPCH3013",
    "اسم المقرر": "Inorganic Chemistry",
    "عدد الطلاب": 3,
    "اليوم": "الثلاثاء",
    "التاريخ": "02/06/2026",
    "الفترة": "8:15 - 10:15",
    "الشعبة": 630,
    "القاعة": "D014"
  },
  {
    "رمز المقرر": "TPCH3014",
    "اسم المقرر": "Analytical Chemistry",
    "عدد الطلاب": 2,
    "اليوم": "الثلاثاء",
    "التاريخ": "09/06/2026",
    "الفترة": "8:15 - 10:15",
    "الشعبة": 640,
    "القاعة": "D05"
  },
  {
    "رمز المقرر": "TPCH3015",
    "اسم المقرر": "Physical Chemistry",
    "عدد الطلاب": 2,
    "اليوم": "الخميس",
    "التاريخ": "04/06/2026",
    "الفترة": "8:15 - 10:15",
    "الشعبة": 630,
    "القاعة": "D07"
  },
  {
    "رمز المقرر": "TPCH3015",
    "اسم المقرر": "Physical Chemistry",
    "عدد الطلاب": 1,
    "اليوم": "الخميس",
    "التاريخ": "04/06/2026",
    "الفترة": "8:15 - 10:15",
    "الشعبة": 640,
    "القاعة": "D014"
  },
  {
    "رمز المقرر": "TPCH4017",
    "اسم المقرر": "Biochemistry",
    "عدد الطلاب": 3,
    "اليوم": "السبت",
    "التاريخ": "06/06/2026",
    "الفترة": "11 - 1",
    "الشعبة": 510,
    "القاعة": "D013"
  },
  {
    "رمز المقرر": "TPCH4019",
    "اسم المقرر": "Applied Chemistry 2",
    "عدد الطلاب": 6,
    "اليوم": "الخميس",
    "التاريخ": "11/06/2026",
    "الفترة": "11 - 1",
    "الشعبة": 730,
    "القاعة": "D014"
  },
  {
    "رمز المقرر": "TPCH4020",
    "اسم المقرر": "Environmental Chemistry",
    "عدد الطلاب": 4,
    "اليوم": "الأحد",
    "التاريخ": "24/05/2026",
    "الفترة": "11 - 1",
    "الشعبة": 730,
    "القاعة": "D09"
  },
  {
    "رمز المقرر": "TPCT2001",
    "اسم المقرر": "Educational Technology",
    "عدد الطلاب": 1,
    "اليوم": "الأربعاء",
    "التاريخ": "03/06/2026",
    "الفترة": "11 - 1",
    "الشعبة": 550,
    "القاعة": "D05"
  },
  {
    "رمز المقرر": "TPCT2003",
    "اسم المقرر": "Science Teaching Methods",
    "عدد الطلاب": 1,
    "اليوم": "الثلاثاء",
    "التاريخ": "09/06/2026",
    "الفترة": "11 - 1",
    "الشعبة": 510,
    "القاعة": "D014"
  },
  {
    "رمز المقرر": "TPEN1002",
    "اسم المقرر": "English Language 2",
    "عدد الطلاب": 1,
    "اليوم": "الأحد",
    "التاريخ": "07/06/2026",
    "الفترة": "8:15 - 10:15",
    "الشعبة": 830,
    "القاعة": "D07"
  },
  {
    "رمز المقرر": "TPEN1002",
    "اسم المقرر": "English Language 2",
    "عدد الطلاب": 1,
    "اليوم": "الأحد",
    "التاريخ": "07/06/2026",
    "الفترة": "8:15 - 10:15",
    "الشعبة": 840,
    "القاعة": "D014"
  },
  {
    "رمز المقرر": "TPEN1002",
    "اسم المقرر": "English Language 2",
    "عدد الطلاب": 3,
    "اليوم": "الأحد",
    "التاريخ": "07/06/2026",
    "الفترة": "8:15 - 10:15",
    "الشعبة": 850,
    "القاعة": "D09"
  },
  {
    "رمز المقرر": "TPEN1002",
    "اسم المقرر": "English Language 2",
    "عدد الطلاب": 1,
    "اليوم": "الأحد",
    "التاريخ": "07/06/2026",
    "الفترة": "8:15 - 10:15",
    "الشعبة": 870,
    "القاعة": "D09"
  },
  {
    "رمز المقرر": "TPEN1002",
    "اسم المقرر": "English Language 2",
    "عدد الطلاب": 1,
    "اليوم": "الأحد",
    "التاريخ": "07/06/2026",
    "الفترة": "8:15 - 10:15",
    "الشعبة": 880,
    "القاعة": "D012"
  },
  {
    "رمز المقرر": "TPFA3002",
    "اسم المقرر": "School Management",
    "عدد الطلاب": 2,
    "اليوم": "الأحد",
    "التاريخ": "24/05/2026",
    "الفترة": "11 - 1",
    "الشعبة": 570,
    "القاعة": "D112"
  },
  {
    "رمز المقرر": "TPIS3003",
    "اسم المقرر": "Islamic Culture",
    "عدد الطلاب": 1,
    "اليوم": "الأحد",
    "التاريخ": "31/05/2026",
    "الفترة": "11 - 1",
    "الشعبة": 730,
    "القاعة": "D013"
  },
  {
    "رمز المقرر": "TPMA1008",
    "اسم المقرر": "Geometry 2",
    "عدد الطلاب": 1,
    "اليوم": "الأربعاء",
    "التاريخ": "03/06/2026",
    "الفترة": "11 - 1",
    "الشعبة": 680,
    "القاعة": "C04"
  },
  {
    "رمز المقرر": "TPMA2004",
    "اسم المقرر": "Basic Math 2",
    "عدد الطلاب": 1,
    "اليوم": "السبت",
    "التاريخ": "06/06/2026",
    "الفترة": "8:15 - 10:15",
    "الشعبة": 530,
    "القاعة": "D09"
  },
  {
    "رمز المقرر": "TPMA2005",
    "اسم المقرر": "Mathematics and Biology",
    "عدد الطلاب": 1,
    "اليوم": "الخميس",
    "التاريخ": "11/06/2026",
    "الفترة": "8:15 - 10:15",
    "الشعبة": 710,
    "القاعة": "D07"
  },
  {
    "رمز المقرر": "TPMA2014",
    "اسم المقرر": "Calculus 3",
    "عدد الطلاب": 1,
    "اليوم": "الإثنين",
    "التاريخ": "08/06/2026",
    "الفترة": "11 - 1",
    "الشعبة": 580,
    "القاعة": "D05"
  },
  {
    "رمز المقرر": "TPMA2015",
    "اسم المقرر": "Ordinary Differential Equations",
    "عدد الطلاب": 2,
    "اليوم": "الثلاثاء",
    "التاريخ": "02/06/2026",
    "الفترة": "8:15 - 10:15",
    "الشعبة": 580,
    "القاعة": "D07"
  },
  {
    "رمز المقرر": "TPMA3016",
    "اسم المقرر": "Mathematical Methods",
    "عدد الطلاب": 1,
    "اليوم": "الخميس",
    "التاريخ": "04/06/2026",
    "الفترة": "8:15 - 10:15",
    "الشعبة": 770,
    "القاعة": "D012"
  },
  {
    "رمز المقرر": "TPMA3020",
    "اسم المقرر": "Partial Differential Equations",
    "عدد الطلاب": 3,
    "اليوم": "الأحد",
    "التاريخ": "31/05/2026",
    "الفترة": "8:15 - 10:15",
    "الشعبة": 670,
    "القاعة": "D113"
  },
  {
    "رمز المقرر": "TPMA3020",
    "اسم المقرر": "Partial Differential Equations",
    "عدد الطلاب": 2,
    "اليوم": "الأحد",
    "التاريخ": "31/05/2026",
    "الفترة": "8:15 - 10:15",
    "الشعبة": 680,
    "القاعة": "D113"
  },
  {
    "رمز المقرر": "TPMA3021",
    "اسم المقرر": "Principles of Mathematics",
    "عدد الطلاب": 3,
    "اليوم": "الأربعاء",
    "التاريخ": "10/06/2026",
    "الفترة": "8:15 - 10:15",
    "الشعبة": 670,
    "القاعة": "C04"
  },
  {
    "رمز المقرر": "TPMA3021",
    "اسم المقرر": "Principles of Mathematics",
    "عدد الطلاب": 1,
    "اليوم": "الأربعاء",
    "التاريخ": "10/06/2026",
    "الفترة": "8:15 - 10:15",
    "الشعبة": 680,
    "القاعة": "C04"
  },
  {
    "رمز المقرر": "TPMA4026",
    "اسم المقرر": "Mathematics for Teachers",
    "عدد الطلاب": 2,
    "اليوم": "الخميس",
    "التاريخ": "11/06/2026",
    "الفترة": "11 - 1",
    "الشعبة": 770,
    "القاعة": "D012"
  },
  {
    "رمز المقرر": "TPMA4026",
    "اسم المقرر": "Mathematics for Teachers",
    "عدد الطلاب": 2,
    "اليوم": "الخميس",
    "التاريخ": "11/06/2026",
    "الفترة": "11 - 1",
    "الشعبة": 780,
    "القاعة": "D014"
  },
  {
    "رمز المقرر": "TPMA4027",
    "اسم المقرر": "Numerical Analysis",
    "عدد الطلاب": 2,
    "اليوم": "الإثنين",
    "التاريخ": "08/06/2026",
    "الفترة": "11 - 1",
    "الشعبة": 770,
    "القاعة": "D014"
  },
  {
    "رمز المقرر": "TPMA4027",
    "اسم المقرر": "Numerical Analysis",
    "عدد الطلاب": 1,
    "اليوم": "الإثنين",
    "التاريخ": "08/06/2026",
    "الفترة": "11 - 1",
    "الشعبة": 780,
    "القاعة": "D012"
  },
  {
    "رمز المقرر": "TPMA4029",
    "اسم المقرر": "Sampling Methods",
    "عدد الطلاب": 4,
    "اليوم": "الإثنين",
    "التاريخ": "25/05/2026",
    "الفترة": "8:15 - 10:15",
    "الشعبة": 770,
    "القاعة": "D05"
  },
  {
    "رمز المقرر": "TPOH4005",
    "اسم المقرر": "Oman History",
    "عدد الطلاب": 1,
    "اليوم": "الأحد",
    "التاريخ": "31/05/2026",
    "الفترة": "11 - 1",
    "الشعبة": 730,
    "القاعة": "D012"
  },
  {
    "رمز المقرر": "TPPH1004",
    "اسم المقرر": "General Physics for Mathematics",
    "عدد الطلاب": 1,
    "اليوم": "الأربعاء",
    "التاريخ": "10/06/2026",
    "الفترة": "8:15 - 10:15",
    "الشعبة": 840,
    "القاعة": "D07"
  },
  {
    "رمز المقرر": "TPPH1005",
    "اسم المقرر": "General Physics for Biology",
    "عدد الطلاب": 1,
    "اليوم": "الخميس",
    "التاريخ": "11/06/2026",
    "الفترة": "11 - 1",
    "الشعبة": 850,
    "القاعة": "D09"
  },
  {
    "رمز المقرر": "TPPH1006",
    "اسم المقرر": "General Physics for Chemistry",
    "عدد الطلاب": 1,
    "اليوم": "الخميس",
    "التاريخ": "11/06/2026",
    "الفترة": "11 - 1",
    "الشعبة": 820,
    "القاعة": "D013"
  },
  {
    "رمز المقرر": "TPPH2007",
    "اسم المقرر": "General Physics for Mathematics",
    "عدد الطلاب": 2,
    "اليوم": "السبت",
    "التاريخ": "06/06/2026",
    "الفترة": "11 - 1",
    "الشعبة": 580,
    "القاعة": "D07"
  },
  {
    "رمز المقرر": "TPPH2010",
    "اسم المقرر": "Electromagnetic Theory",
    "عدد الطلاب": 4,
    "اليوم": "الأربعاء",
    "التاريخ": "10/06/2026",
    "الفترة": "8:15 - 10:15",
    "الشعبة": 650,
    "القاعة": "D05"
  },
  {
    "رمز المقرر": "TPPH2012",
    "اسم المقرر": "Electric Circuits",
    "عدد الطلاب": 3,
    "اليوم": "الإثنين",
    "التاريخ": "25/05/2026",
    "الفترة": "8:15 - 10:15",
    "الشعبة": 550,
    "القاعة": "D013"
  },
  {
    "رمز المقرر": "TPPH3016",
    "اسم المقرر": "Solid State Physics",
    "عدد الطلاب": 3,
    "اليوم": "الإثنين",
    "التاريخ": "01/06/2026",
    "الفترة": "8:15 - 10:15",
    "الشعبة": 660,
    "القاعة": "D012"
  },
  {
    "رمز المقرر": "TPPH3017",
    "اسم المقرر": "Mathematical Physics",
    "عدد الطلاب": 3,
    "اليوم": "الخميس",
    "التاريخ": "11/06/2026",
    "الفترة": "8:15 - 10:15",
    "الشعبة": 650,
    "القاعة": "D09"
  },
  {
    "رمز المقرر": "TPPH3018",
    "اسم المقرر": "Atomic Physics and Spectra",
    "عدد الطلاب": 1,
    "اليوم": "الخميس",
    "التاريخ": "04/06/2026",
    "الفترة": "11 - 1",
    "الشعبة": 650,
    "القاعة": "D013"
  },
  {
    "رمز المقرر": "TPPH3018",
    "اسم المقرر": "Atomic Physics and Spectra",
    "عدد الطلاب": 1,
    "اليوم": "الخميس",
    "التاريخ": "04/06/2026",
    "الفترة": "11 - 1",
    "الشعبة": 660,
    "القاعة": "D09"
  },
  {
    "رمز المقرر": "TPPH4019",
    "اسم المقرر": "Mathematical Physics",
    "عدد الطلاب": 2,
    "اليوم": "السبت",
    "التاريخ": "06/06/2026",
    "الفترة": "8:15 - 10:15",
    "الشعبة": 750,
    "القاعة": "D07"
  },
  {
    "رمز المقرر": "TPPH4021",
    "اسم المقرر": "Laser Physics and Plasma",
    "عدد الطلاب": 4,
    "اليوم": "الثلاثاء",
    "التاريخ": "02/06/2026",
    "الفترة": "11 - 1",
    "الشعبة": 750,
    "القاعة": "D012"
  },
  {
    "رمز المقرر": "TPPH4022",
    "اسم المقرر": "Introduction to Astronomy",
    "عدد الطلاب": 1,
    "اليوم": "الأربعاء",
    "التاريخ": "03/06/2026",
    "الفترة": "8:15 - 10:15",
    "الشعبة": 720,
    "القاعة": "D05"
  },
  {
    "رمز المقرر": "TPPH4022",
    "اسم المقرر": "Introduction to Astronomy",
    "عدد الطلاب": 2,
    "اليوم": "الأربعاء",
    "التاريخ": "03/06/2026",
    "الفترة": "8:15 - 10:15",
    "الشعبة": 730,
    "القاعة": "D05"
  },
  {
    "رمز المقرر": "TPPH4023",
    "اسم المقرر": "Nuclear Physics",
    "عدد الطلاب": 3,
    "اليوم": "الأحد",
    "التاريخ": "31/05/2026",
    "الفترة": "8:15 - 10:15",
    "الشعبة": 750,
    "القاعة": "D013"
  },
  {
    "رمز المقرر": "TPPS3003",
    "اسم المقرر": "Psychological Assessment",
    "عدد الطلاب": 1,
    "اليوم": "الأحد",
    "التاريخ": "07/06/2026",
    "الفترة": "11 - 1",
    "الشعبة": 620,
    "القاعة": "D013"
  },
  {
    "رمز المقرر": "TPPS3003",
    "اسم المقرر": "Psychological Assessment",
    "عدد الطلاب": 3,
    "اليوم": "الأحد",
    "التاريخ": "07/06/2026",
    "الفترة": "11 - 1",
    "الشعبة": 640,
    "القاعة": "D012"
  },
  {
    "رمز المقرر": "TPPS3003",
    "اسم المقرر": "Psychological Assessment",
    "عدد الطلاب": 1,
    "اليوم": "الأحد",
    "التاريخ": "07/06/2026",
    "الفترة": "11 - 1",
    "الشعبة": 650,
    "القاعة": "D012"
  },
  {
    "رمز المقرر": "TPPS4004",
    "اسم المقرر": "Developmental Psychology",
    "عدد الطلاب": 4,
    "اليوم": "الإثنين",
    "التاريخ": "25/05/2026",
    "الفترة": "11 - 1",
    "الشعبة": 670,
    "القاعة": "D014"
  },
  {
    "رمز المقرر": "UNAB4105",
    "اسم المقرر": "ARABIC LANGUAGE SKILLS",
    "عدد الطلاب": 29,
    "اليوم": "الإثنين",
    "التاريخ": "08/06/2026",
    "الفترة": "11 - 1",
    "الشعبة": 1,
    "القاعة": "D013"
  },
  {
    "رمز المقرر": "UNAB4105",
    "اسم المقرر": "ARABIC LANGUAGE SKILLS",
    "عدد الطلاب": 24,
    "اليوم": "الإثنين",
    "التاريخ": "08/06/2026",
    "الفترة": "11 - 1",
    "الشعبة": 2,
    "القاعة": "D014"
  },
  {
    "رمز المقرر": "UNAB4105",
    "اسم المقرر": "ARABIC LANGUAGE SKILLS",
    "عدد الطلاب": 33,
    "اليوم": "الإثنين",
    "التاريخ": "08/06/2026",
    "الفترة": "11 - 1",
    "الشعبة": 3,
    "القاعة": "C03"
  },
  {
    "رمز المقرر": "UNAB4105",
    "اسم المقرر": "ARABIC LANGUAGE SKILLS",
    "عدد الطلاب": 12,
    "اليوم": "الإثنين",
    "التاريخ": "08/06/2026",
    "الفترة": "11 - 1",
    "الشعبة": 4,
    "القاعة": "D113"
  },
  {
    "رمز المقرر": "UNAB4105",
    "اسم المقرر": "ARABIC LANGUAGE SKILLS",
    "عدد الطلاب": 29,
    "اليوم": "الإثنين",
    "التاريخ": "08/06/2026",
    "الفترة": "11 - 1",
    "الشعبة": 5,
    "القاعة": "D012"
  },
  {
    "رمز المقرر": "UNAB4105",
    "اسم المقرر": "ARABIC LANGUAGE SKILLS",
    "عدد الطلاب": 18,
    "اليوم": "الإثنين",
    "التاريخ": "08/06/2026",
    "الفترة": "11 - 1",
    "الشعبة": 6,
    "القاعة": "D113"
  },
  {
    "رمز المقرر": "UNEN1102",
    "اسم المقرر": "ENGLISH FOR ACADEMIC PURPOSES (English I)",
    "عدد الطلاب": 37,
    "اليوم": "الإثنين",
    "التاريخ": "01/06/2026",
    "الفترة": "9 - 11",
    "الشعبة": 1,
    "القاعة": "D05"
  },
  {
    "رمز المقرر": "UNEN1102",
    "اسم المقرر": "ENGLISH FOR ACADEMIC PURPOSES (English I)",
    "عدد الطلاب": 20,
    "اليوم": "الإثنين",
    "التاريخ": "01/06/2026",
    "الفترة": "9 - 11",
    "الشعبة": 2,
    "القاعة": "D07"
  },
  {
    "رمز المقرر": "UNEN1202",
    "اسم المقرر": "اللغة الإنجليزية 2",
    "عدد الطلاب": 24,
    "اليوم": "الأحد",
    "التاريخ": "07/06/2026",
    "الفترة": "8:15 - 10:15",
    "الشعبة": 1,
    "القاعة": "D05"
  },
  {
    "رمز المقرر": "UNEN1202",
    "اسم المقرر": "اللغة الإنجليزية 2",
    "عدد الطلاب": 22,
    "اليوم": "الأحد",
    "التاريخ": "07/06/2026",
    "الفترة": "8:15 - 10:15",
    "الشعبة": 2,
    "القاعة": "D114"
  },
  {
    "رمز المقرر": "UNEN1202",
    "اسم المقرر": "اللغة الإنجليزية 2",
    "عدد الطلاب": 21,
    "اليوم": "الأحد",
    "التاريخ": "07/06/2026",
    "الفترة": "8:15 - 10:15",
    "الشعبة": 3,
    "القاعة": "D104"
  },
  {
    "رمز المقرر": "UNEN1202",
    "اسم المقرر": "اللغة الإنجليزية 2",
    "عدد الطلاب": 11,
    "اليوم": "الأحد",
    "التاريخ": "07/06/2026",
    "الفترة": "8:15 - 10:15",
    "الشعبة": 4,
    "القاعة": "D113"
  },
  {
    "رمز المقرر": "UNEN1202",
    "اسم المقرر": "اللغة الإنجليزية 2",
    "عدد الطلاب": 24,
    "اليوم": "الأحد",
    "التاريخ": "07/06/2026",
    "الفترة": "8:15 - 10:15",
    "الشعبة": 5,
    "القاعة": "D09"
  },
  {
    "رمز المقرر": "UNEN1202",
    "اسم المقرر": "اللغة الإنجليزية 2",
    "عدد الطلاب": 13,
    "اليوم": "الأحد",
    "التاريخ": "07/06/2026",
    "الفترة": "8:15 - 10:15",
    "الشعبة": 6,
    "القاعة": "D113"
  },
  {
    "رمز المقرر": "UNEN1202",
    "اسم المقرر": "اللغة الإنجليزية 2",
    "عدد الطلاب": 10,
    "اليوم": "الأحد",
    "التاريخ": "07/06/2026",
    "الفترة": "8:15 - 10:15",
    "الشعبة": 7,
    "القاعة": "D05"
  },
  {
    "رمز المقرر": "UNEN1202",
    "اسم المقرر": "اللغة الإنجليزية 2",
    "عدد الطلاب": 29,
    "اليوم": "الأحد",
    "التاريخ": "07/06/2026",
    "الفترة": "8:15 - 10:15",
    "الشعبة": 8,
    "القاعة": "D014"
  },
  {
    "رمز المقرر": "UNEN1203",
    "اسم المقرر": "TECHNICAL WRITING (English II)",
    "عدد الطلاب": 23,
    "اليوم": "الإثنين",
    "التاريخ": "01/06/2026",
    "الفترة": "12:00 - 2:00",
    "الشعبة": 1,
    "القاعة": "D09"
  },
  {
    "رمز المقرر": "UNEN1203",
    "اسم المقرر": "TECHNICAL WRITING (English II)",
    "عدد الطلاب": 18,
    "اليوم": "الإثنين",
    "التاريخ": "01/06/2026",
    "الفترة": "12:00 - 2:00",
    "الشعبة": 2,
    "القاعة": "D07"
  },
  {
    "رمز المقرر": "UNEN3105",
    "اسم المقرر": "English for College and Professional Use",
    "عدد الطلاب": 25,
    "اليوم": "الإثنين",
    "التاريخ": "25/05/2026",
    "الفترة": "8:15 - 10:15",
    "الشعبة": 1,
    "القاعة": "D09"
  },
  {
    "رمز المقرر": "UNEN3105",
    "اسم المقرر": "English for College and Professional Use",
    "عدد الطلاب": 17,
    "اليوم": "الإثنين",
    "التاريخ": "25/05/2026",
    "الفترة": "8:15 - 10:15",
    "الشعبة": 2,
    "القاعة": "D07"
  },
  {
    "رمز المقرر": "UNIS2206",
    "اسم المقرر": "Islamic Studies",
    "عدد الطلاب": 15,
    "اليوم": "الأحد",
    "التاريخ": "31/05/2026",
    "الفترة": "11 - 1",
    "الشعبة": 1,
    "القاعة": "D09"
  },
  {
    "رمز المقرر": "UNIS2206",
    "اسم المقرر": "Islamic Studies",
    "عدد الطلاب": 12,
    "اليوم": "الأحد",
    "التاريخ": "31/05/2026",
    "الفترة": "11 - 1",
    "الشعبة": 2,
    "القاعة": "D09"
  },
  {
    "رمز المقرر": "UNIS2206",
    "اسم المقرر": "Islamic Studies",
    "عدد الطلاب": 27,
    "اليوم": "الأحد",
    "التاريخ": "31/05/2026",
    "الفترة": "11 - 1",
    "الشعبة": 3,
    "القاعة": "D013"
  },
  {
    "رمز المقرر": "UNOS2207",
    "اسم المقرر": "Oman State and People",
    "عدد الطلاب": 24,
    "اليوم": "الأحد",
    "التاريخ": "31/05/2026",
    "الفترة": "11 - 1",
    "الشعبة": 1,
    "القاعة": "D07"
  },
  {
    "رمز المقرر": "UNOS2207",
    "اسم المقرر": "Oman State and People",
    "عدد الطلاب": 27,
    "اليوم": "الأحد",
    "التاريخ": "31/05/2026",
    "الفترة": "11 - 1",
    "الشعبة": 2,
    "القاعة": "D012"
  },
  {
    "رمز المقرر": "UNOS2207",
    "اسم المقرر": "Oman State and People",
    "عدد الطلاب": 25,
    "اليوم": "الأحد",
    "التاريخ": "31/05/2026",
    "الفترة": "11 - 1",
    "الشعبة": 3,
    "القاعة": "D014"
  }
];
